{
  "status": "completed",
  "job_id": "624761a2-963a-44db-9995-6dee5e743ae7",
  "user_email": "local_user@localhost",
  "mode": "MULTI_AGENT_ADAPTIVE",
  "regulation_type": "ICDR",
  "drhp_chapter": "CHAPTER_V_ABOUT_COMPANY",
  "drhp_chapter_name": "CHAPTER V – ABOUT THE COMPANY",
  "document_name": "Eco_fuel_Systems_India_Limited_DRHP.pdf",
  "total_requirements": 60,
  "summary": {
    "PRESENT": 0,
    "INSUFFICIENT": 5,
    "MISSING": 55,
    "UNCLEAR": 0
  },
  "priority_summary": {
    "CRITICAL": 7,
    "HIGH": 48,
    "MEDIUM": 0,
    "LOW": 5
  },
  "items": [
    {
      "obligation": "the red-herring prospectus, and prospectus shall contain disclosures specified in the Companies Act, 2013",
      "citation": "ICDR_2018 Chapter II Unit 24",
      "chapter": "Chapter II",
      "mandatory": true,
      "status": "INSUFFICIENT",
      "explanation": "The DRHP acknowledges the requirement for disclosures as per the Companies Act, 2013, and Part A of Schedule VI. However, the provided snippets do not contain the actual disclosures themselves. They are introductory statements or brief operational details, not the comprehensive information mandated by the law. Therefore, while the intent to comply is stated, the content demonstrating compliance is missing.",
      "evidence": "Some of the information in this section, including information with respect to our plans and strategies, contain forward – looking statements that involve risks and uncertainties. Before deciding to invest in the Equity Shares, Shareholders should read this Draft Red Herring Prospectus. An investment in the Equity Shares involves a high degree of risk. For a discussion of certain risks in connection with investments in the Equity Shares, you should read “Risk Factors” on page 2",
      "missing_details": "Full disclosures as specified in the Companies Act, 2013 and Part A of Schedule VI, including but not limited to, financial statements, management discussion and analysis, details of promoters, directors, objects of the issue, risk factors, etc.",
      "confidence": 0.9,
      "pages": [
        1,
        7,
        10
      ],
      "priority": "LOW",
      "recommendations": [
        "⚠️  ENHANCE: Current disclosure is incomplete",
        "📋 Add the following: Full disclosures as specified in the Companies Act, 2013 and Part A of Schedule VI, including but not limited to, financial statements, management discussion and analysis, details of promoters, directors, objects of the issue, risk factors, etc.",
        "📄 Current content location: Pages 1, 7, 10"
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "The abridged letter of offer shall contain the disclosures as specified by the Board in Part F of Schedule VI.",
      "citation": "ICDR_2018 Chapter III Unit 75",
      "chapter": "Chapter III",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information related to the abridged letter of offer or its specific disclosure requirements as per Part F of Schedule VI. The content focuses on project execution, business overview, dealers, and retro-fitment capacity, which are typically found in the main body of the prospectus or offer document, not the abridged letter of offer.",
      "evidence": "",
      "missing_details": "Abridged letter of offer content as specified by the Board in Part F of Schedule VI",
      "confidence": 1.0,
      "pages": [
        1,
        6,
        10
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: The abridged letter of offer shall contain the disclosures as specified by the Board in Part F of Schedule VI.",
        "📋 Required details: Abridged letter of offer content as specified by the Board in Part F of Schedule VI",
        "📚 Legal Reference: The abridged prospectus shall contain the disclosures as specified in Part E of Schedule VI and shall not contain any matter extraneous to the content..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "the red-herring prospectus, and prospectus shall contain disclosures specified in Part A of Schedule VI",
      "citation": "ICDR_2018 Chapter II Unit 24",
      "chapter": "Chapter II",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information that directly addresses the legal obligation to include disclosures specified in Part A of Schedule VI or the Companies Act, 2013. The excerpts focus on business overview, dealer networks, retro-fitment capacity, project execution, and government customer tenders, but lack the specific compliance-related disclosures required by law.",
      "evidence": "",
      "missing_details": "Disclosures specified in Part A of Schedule VI, Disclosures specified in the Companies Act, 2013",
      "confidence": 1.0,
      "pages": [
        1,
        6,
        10
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: the red-herring prospectus, and prospectus shall contain disclosures specified in Part A of Schedule VI",
        "📋 Required details: Disclosures specified in Part A of Schedule VI, Disclosures specified in the Companies Act, 2013",
        "📚 Legal Reference: the red-herring prospectus, and prospectus shall contain disclosures specified in Part A of Schedule VI..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "The lead manager(s) shall submit a statement certifying that all changes, suggestions and observations made by the Board have been incorporated in the offer document, a due diligence certificate as per Form C of Schedule V, a copy of the resolution passed by the board of directors of the issuer for allotting specified securities to promoter(s) towards amount received against promoters’ contribution, a certificate from a statutory auditor certifying promoters’ contribution, and a due diligence certificate as per Form D of Schedule V (if applicable), to the Board after issuance of observations by the Board or after expiry of the period stipulated in sub-regulation (4) if the Board has not issued observations.",
      "citation": "ICDR_2018 Chapter II Unit 25",
      "chapter": "Chapter II",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information related to the lead manager's submission of a statement certifying the incorporation of SEBI's observations, a due diligence certificate as per Form C of Schedule V, a board resolution for promoter's contribution allotment, or a statutory auditor's certificate for promoters' contribution. These are post-observation submission requirements.",
      "evidence": "",
      "missing_details": "Statement certifying incorporation of SEBI's observations, Due diligence certificate as per Form C of Schedule V, Board resolution for allotment of securities to promoters against promoters' contribution, Certificate from statutory auditor certifying promoters' contribution, Due diligence certificate as per Form D of Schedule V (if applicable)",
      "confidence": 1.0,
      "pages": [
        1,
        3,
        6
      ],
      "priority": "CRITICAL",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: The lead manager(s) shall submit a statement certifying that all changes, suggestions and observations made by the Board have been incorporated in the offer document, a due diligence certificate as per Form C of Schedule V, a copy of the resolution passed by the board of directors of the issuer for allotting specified securities to promoter(s) towards amount received against promoters’ contribution, a certificate from a statutory auditor certifying promoters’ contribution, and a due diligence certificate as per Form D of Schedule V (if applicable), to the Board after issuance of observations by the Board or after expiry of the period stipulated in sub-regulation (4) if the Board has not issued observations.",
        "📋 Required details: Statement certifying incorporation of SEBI's observations, Due diligence certificate as per Form C of Schedule V, Board resolution for allotment of securities to promoters against promoters' contribution, Certificate from statutory auditor certifying promoters' contribution, Due diligence certificate as per Form D of Schedule V (if applicable)",
        "📚 Legal Reference: The lead manager(s) shall submit a statement certifying that all changes, suggestions and observations made by the Board have been incorporated in the..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "The letter of offer shall also be provided by the issuer or lead manager(s) to any existing shareholder who makes a request in this regard.",
      "citation": "ICDR_2018 Chapter III Unit 76",
      "chapter": "Chapter III",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information related to the obligation of the issuer or lead manager(s) to provide the letter of offer to existing shareholders upon request. This is a procedural requirement for IPOs.",
      "evidence": "",
      "missing_details": "Provision of Letter of Offer to existing shareholders upon request.",
      "confidence": 1.0,
      "pages": [
        3,
        6,
        10
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: The letter of offer shall also be provided by the issuer or lead manager(s) to any existing shareholder who makes a request in this regard.",
        "📋 Required details: Provision of Letter of Offer to existing shareholders upon request.",
        "📚 Legal Reference: The lead manager(s) shall call upon the issuer, its promoters and its directors or in case of an offer for sale, also the selling shareholders, to ful..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "The promoters, or shareholders in control of an issuer, shall provide an exit offer to dissenting shareholders as provided for in the Companies Act, 2013, in case of change in objects or variation in the terms of contract related to objects referred to in the offer document as per conditions and manner is provided in Schedule XX",
      "citation": "ICDR_2018 Chapter II Unit 59",
      "chapter": "Chapter II",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information related to an exit offer for dissenting shareholders in case of a change in objects or variation in contract terms. This legal obligation requires specific disclosures and procedures to be outlined, which are absent here.",
      "evidence": "",
      "missing_details": "Details of the exit offer mechanism for dissenting shareholders, conditions and manner of providing the exit offer as per Schedule XX, information on promoters' or controlling shareholders' obligations regarding such exit offers.",
      "confidence": 1.0,
      "pages": [
        1,
        4,
        5
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: The promoters, or shareholders in control of an issuer, shall provide an exit offer to dissenting shareholders as provided for in the Companies Act, 2013, in case of change in objects or variation in the terms of contract related to objects referred to in the offer document as per conditions and manner is provided in Schedule XX",
        "📋 Required details: Details of the exit offer mechanism for dissenting shareholders, conditions and manner of providing the exit offer as per Schedule XX, information on promoters' or controlling shareholders' obligations regarding such exit offers.",
        "📚 Legal Reference: In case the promoters have to subscribe to equity shares or convertible securities towards minimum promoters’ contribution, the amount of promoters’ c..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "Except for anything contrary provided in this Chapter, the provisions of Chapter -II shall mutatis mutandis apply in relation to the initial public offer made under the provisions of this Chapter.",
      "citation": "ICDR_2018 Chapter II Unit 59B",
      "chapter": "Chapter II",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information related to the minimum offer to the public or its compliance with the provisions of clause (b) of sub-rule (2) of rule 19 of Securities Contracts (Regulations) Rules, 1957. This is a critical disclosure requirement for an IPO.",
      "evidence": "",
      "missing_details": "Details regarding the minimum offer to the public and its compliance with Rule 19(2)(b) of the Securities Contracts (Regulations) Rules, 1957.",
      "confidence": 1.0,
      "pages": [
        1,
        6,
        9
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: Except for anything contrary provided in this Chapter, the provisions of Chapter -II shall mutatis mutandis apply in relation to the initial public offer made under the provisions of this Chapter.",
        "📋 Required details: Details regarding the minimum offer to the public and its compliance with Rule 19(2)(b) of the Securities Contracts (Regulations) Rules, 1957.",
        "📚 Legal Reference: Unless otherwise provided in this Chapter, an issuer making an initial public offer of specified securities shall satisfy the conditions of this Chapt..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "The issuer shall also file the draft letter of offer with the stock exchange(s) and shall submit the Permanent Account Number, bank account number and passport number of its promoters where they are individuals, and Permanent Account Number, bank account number, company registration number or equivalent and the address of the Registrar of Companies with which the promoter is registered, where the promoter is a body corporate.",
      "citation": "ICDR_2018 Chapter III Unit 71",
      "chapter": "Chapter III",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content discusses the company's business, market position, and operational aspects. However, it does not contain any information related to the promoters' Permanent Account Number, bank account number, passport number (for individuals), or company registration number and Registrar of Companies address (for corporate promoters), which is a mandatory filing requirement.",
      "evidence": "",
      "missing_details": "Permanent Account Number of promoters (individual and corporate), Bank account number of promoters (individual and corporate), Passport number of promoters (individual), Company registration number or equivalent of promoters (corporate), Address of the Registrar of Companies with which the promoter is registered (corporate)",
      "confidence": 1.0,
      "pages": [
        2,
        5,
        6
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: The issuer shall also file the draft letter of offer with the stock exchange(s) and shall submit the Permanent Account Number, bank account number and passport number of its promoters where they are individuals, and Permanent Account Number, bank account number, company registration number or equivalent and the address of the Registrar of Companies with which the promoter is registered, where the promoter is a body corporate.",
        "📋 Required details: Permanent Account Number of promoters (individual and corporate), Bank account number of promoters (individual and corporate), Passport number of promoters (individual), Company registration number or equivalent of promoters (corporate), Address of the Registrar of Companies with which the promoter is registered (corporate)",
        "📚 Legal Reference: The issuer shall also file the draft offer document with the stock exchange(s) where the specified securities are proposed to be listed, and submit th..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "The draft letter of offer and letter of offer shall contain disclosures as specified in Part B or Part B -1 of Schedule VI, as applicable.",
      "citation": "ICDR_2018 Chapter III Unit 70(2)",
      "chapter": "Chapter III",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information related to the terms of conversion or exchange, which is a mandatory disclosure requirement for offer documents according to Legal Requirement 2. The content focuses on project execution, dealer networks, and revenue from product sales.",
      "evidence": "",
      "missing_details": "Full disclosures of the terms of conversion or exchange",
      "confidence": 1.0,
      "pages": [
        6,
        7,
        10
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: The draft letter of offer and letter of offer shall contain disclosures as specified in Part B or Part B -1 of Schedule VI, as applicable.",
        "📋 Required details: Full disclosures of the terms of conversion or exchange",
        "📚 Legal Reference: The abridged prospectus shall contain the disclosures as specified in Part E of Schedule VI and shall not contain any matter extraneous to the content..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "The lead manager(s) shall exercise due diligence and satisfy themselves about all aspects of the issue including the veracity and adequacy of disclosure in the draft letter of offer and the letter of offer.",
      "citation": "ICDR_2018 Chapter III Unit 70(3)",
      "chapter": "Chapter III",
      "mandatory": true,
      "status": "INSUFFICIENT",
      "explanation": "The provided DRHP content acknowledges the presence of forward-looking statements and directs readers to the 'Risk Factors' section. However, it does not demonstrate the lead manager's due diligence in verifying the veracity and adequacy of disclosures across all aspects of the issue, as required by Legal Requirement 1. The content is too limited to assess this.",
      "evidence": "Some of the information in this section, including information with respect to our plans and strategies, contain forward – looking statements that involve risks and uncertainties. Before deciding to invest in the Equity Shares, Shareholders should read this Draft Red Herring Prospectus. An investment in the Equity Shares involves a high degree of risk. For a discussion of certain risks in connection with investments in the Equity Shares, you should read “Risk Factors” on page 2",
      "missing_details": "Demonstration of lead manager's due diligence process, verification of specific disclosures related to business operations, financial information, and risk factors.",
      "confidence": 0.7,
      "pages": [
        1,
        6,
        10
      ],
      "priority": "LOW",
      "recommendations": [
        "⚠️  ENHANCE: Current disclosure is incomplete",
        "📋 Add the following: Demonstration of lead manager's due diligence process, verification of specific disclosures related to business operations, financial information, and risk factors.",
        "📄 Current content location: Pages 1, 6, 10"
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "The lead manager(s) shall submit a statement certifying that all changes, suggestions and observations made by the Board have been incorporated in the letter of offer, to the Board after issuance of observations by the Board or after expiry of the period stipulated in sub-regulation (4) of regulation 71 if the Board has not issued observations.",
      "citation": "ICDR_2018 Chapter III Unit 71",
      "chapter": "Chapter III",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information related to the lead manager's submission of a statement certifying the incorporation of the Board's suggestions and observations, nor does it include a due diligence certificate or details of public comments. This obligation pertains to post-observation submissions by the lead manager, which are not reflected in the excerpt.",
      "evidence": "",
      "missing_details": "Statement certifying incorporation of Board's suggestions and observations, Due diligence certificate as per Form C of Schedule V, Details of comments received from the public and consequential changes.",
      "confidence": 1.0,
      "pages": [
        1,
        3,
        6
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: The lead manager(s) shall submit a statement certifying that all changes, suggestions and observations made by the Board have been incorporated in the letter of offer, to the Board after issuance of observations by the Board or after expiry of the period stipulated in sub-regulation (4) of regulation 71 if the Board has not issued observations.",
        "📋 Required details: Statement certifying incorporation of Board's suggestions and observations, Due diligence certificate as per Form C of Schedule V, Details of comments received from the public and consequential changes.",
        "📚 Legal Reference: The lead manager(s) shall submit a statement certifying that all changes, suggestions and observations made by the Board have been incorporated in the..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "If the issuer making an initial public offer, other than through the book building process, desires to have the issue underwritten to cover under-subscription in the issue, it shall, prior to the",
      "citation": "ICDR_2018 Chapter II Unit 40",
      "chapter": "Chapter II",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information regarding an underwriting agreement with merchant bankers or stock brokers for covering under-subscription, which is a mandatory requirement for an IPO not through book building. The content focuses on business operations and risk factors.",
      "evidence": "",
      "missing_details": "Underwriting agreement with merchant bankers or stock brokers registered with the Board, indicating the number of specified securities they shall subscribe to on account of rejection of applications.",
      "confidence": 1.0,
      "pages": [
        1,
        4,
        6
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: If the issuer making an initial public offer, other than through the book building process, desires to have the issue underwritten to cover under-subscription in the issue, it shall, prior to the",
        "📋 Required details: Underwriting agreement with merchant bankers or stock brokers registered with the Board, indicating the number of specified securities they shall subscribe to on account of rejection of applications.",
        "📚 Legal Reference: If the issuer making an initial public offer, other than through the book building process, desires to have the issue underwritten to cover under-subs..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "Details specified in sub regulation (1) shall also be placed on the websites of the stock exchange(s).",
      "citation": "ICDR_2018 Chapter II Unit 51",
      "chapter": "Chapter II",
      "mandatory": true,
      "status": "INSUFFICIENT",
      "explanation": "The DRHP content includes financial ratios like EBITDA Margin, RoE, RoCE, and Debt to EBITDA Ratio. However, it does not explicitly state that these ratios are computed for both the upper and lower ends of the price band, nor does it include a statement drawing attention to the 'basis of issue price' section as required by Legal Requirement 2. The information about placing details on stock exchange websites (Legal Requirement 1) is not present in the provided DRHP excerpts.",
      "evidence": "EBITDA Margin(%) 21.60% 15.08% 7.87%\nRoE (%) 17.20% 12.52% 3.43%\nRoCE (%) 21.09% 14.66% 6.16%\nDebt to EBITDA Ratio 0.68 1.68 5.07",
      "missing_details": "Confirmation that financial ratios are computed for both upper and lower ends of the price band, Statement drawing investor attention to the 'basis of issue price' section, Confirmation of details being placed on stock exchange websites",
      "confidence": 0.8,
      "pages": [
        1,
        3,
        6
      ],
      "priority": "LOW",
      "recommendations": [
        "⚠️  ENHANCE: Current disclosure is incomplete",
        "📋 Add the following: Confirmation that financial ratios are computed for both upper and lower ends of the price band, Statement drawing investor attention to the 'basis of issue price' section, Confirmation of details being placed on stock exchange websites",
        "📄 Current content location: Pages 1, 3, 6"
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "The lead manager(s) shall ensure that the monies received in respect of the rights issue are released to the issuer in compliance with the provisions of sub-section (3) of section 40 of the Companies Act, 2013, as applicable.",
      "citation": "ICDR_2018 Chapter III Unit 94",
      "chapter": "Chapter III",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information related to the lead manager's obligation to ensure monies received in respect of the rights issue are released to the issuer in compliance with sub-section (3) of section 40 of the Companies Act, 2013. This specific legal obligation is not addressed in the excerpts.",
      "evidence": "",
      "missing_details": "Information regarding the lead manager's role in ensuring compliance with Companies Act, 2013, sub-section (3) of section 40 for the release of issue monies.",
      "confidence": 1.0,
      "pages": [
        1,
        3,
        6
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: The lead manager(s) shall ensure that the monies received in respect of the rights issue are released to the issuer in compliance with the provisions of sub-section (3) of section 40 of the Companies Act, 2013, as applicable.",
        "📋 Required details: Information regarding the lead manager's role in ensuring compliance with Companies Act, 2013, sub-section (3) of section 40 for the release of issue monies.",
        "📚 Legal Reference: The lead manager(s) shall call upon the issuer, its promoters and its directors or in case of an offer for sale, also the selling shareholders, to ful..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "Specified securities referred to in clauses (a) and (c) of sub-regulation (1) shall be eligible for the computation of promoters’ contribution if such securities are acquired pursuant to a scheme which has been approved by a tribunal or the Central Government under sections 230 to 234 of the Companies Act, 2013.",
      "citation": "ICDR_2018 Chapter II Unit 15",
      "chapter": "Chapter II",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information related to the acquisition of specified securities pursuant to a scheme approved by a tribunal or the Central Government under sections 230 to 234 of the Companies Act, 2013. Therefore, the legal obligation to verify this aspect for the computation of promoters' contribution is not addressed.",
      "evidence": "",
      "missing_details": "Details of any scheme approved by a tribunal or the Central Government under sections 230 to 234 of the Companies Act, 2013, and how specified securities were acquired pursuant to such a scheme for the computation of promoters' contribution.",
      "confidence": 1.0,
      "pages": [
        1,
        3,
        5
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: Specified securities referred to in clauses (a) and (c) of sub-regulation (1) shall be eligible for the computation of promoters’ contribution if such securities are acquired pursuant to a scheme which has been approved by a tribunal or the Central Government under sections 230 to 234 of the Companies Act, 2013.",
        "📋 Required details: Details of any scheme approved by a tribunal or the Central Government under sections 230 to 234 of the Companies Act, 2013, and how specified securities were acquired pursuant to such a scheme for the computation of promoters' contribution.",
        "📚 Legal Reference: Specified securities referred to in clauses (a) and (c) of sub-regulation (1) shall be eligible for the computation of promoters’ contribution if such..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "Unless otherwise provided in this Chapter, an issuer making an initial public offer of specified securities shall satisfy the conditions of this Chapter as on the date of filing of the draft offer document with the Board and also as on the date of filing the offer document with the Registrar of Companies.",
      "citation": "ICDR_2018 Chapter II Unit 4",
      "chapter": "Chapter II",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information regarding an agreement with a depository for the dematerialisation of specified securities, which is a mandatory requirement for an issuer making an initial public offer.",
      "evidence": "",
      "missing_details": "Agreement with a depository for dematerialisation of specified securities.",
      "confidence": 1.0,
      "pages": [
        1,
        3,
        6
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: Unless otherwise provided in this Chapter, an issuer making an initial public offer of specified securities shall satisfy the conditions of this Chapter as on the date of filing of the draft offer document with the Board and also as on the date of filing the offer document with the Registrar of Companies.",
        "📋 Required details: Agreement with a depository for dematerialisation of specified securities.",
        "📚 Legal Reference: Unless otherwise provided in this Chapter, an issuer making an initial public offer of specified securities shall satisfy the conditions of this Chapt..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "the issue can be underwritten only to the extent of entitlement of shareholders other than the promoters and promoter group.",
      "citation": "ICDR_2018 Chapter III Unit 81",
      "chapter": "Chapter III",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information related to the underwriting of the issue concerning the entitlement of shareholders other than promoters and the promoter group. This legal obligation requires specific disclosures about how the underwriting is structured in relation to different shareholder categories.",
      "evidence": "",
      "missing_details": "Details on the extent to which the issue can be underwritten, specifically excluding the entitlement of promoters and the promoter group.",
      "confidence": 1.0,
      "pages": [
        1,
        2,
        4
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: the issue can be underwritten only to the extent of entitlement of shareholders other than the promoters and promoter group.",
        "📋 Required details: Details on the extent to which the issue can be underwritten, specifically excluding the entitlement of promoters and the promoter group.",
        "📚 Legal Reference: An issuer shall not be eligible to make an initial public offer if any of its promoters or directors is a promoter or director of any other company wh..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "The authorised employees of the designated stock exchange, along with the lead manager(s) and registrars to the issue, shall ensure that the basis of allotment is finalised in a fair and proper manner in accordance with the procedure as specified in Part A of Schedule XIV.",
      "citation": "ICDR_2018 Chapter II Unit 49",
      "chapter": "Chapter II",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information related to the basis of allotment, its finalization, or the verification process by authorized employees, lead managers, and registrars. This legal obligation pertains to the post-application and pre-allotment phase, which is not reflected in the given excerpts.",
      "evidence": "",
      "missing_details": "Basis of allotment procedure, confirmation of fair and proper finalization, details of verification by stock exchange employees, lead managers, and registrars",
      "confidence": 1.0,
      "pages": [
        1,
        6,
        10
      ],
      "priority": "CRITICAL",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: The authorised employees of the designated stock exchange, along with the lead manager(s) and registrars to the issue, shall ensure that the basis of allotment is finalised in a fair and proper manner in accordance with the procedure as specified in Part A of Schedule XIV.",
        "📋 Required details: Basis of allotment procedure, confirmation of fair and proper finalization, details of verification by stock exchange employees, lead managers, and registrars",
        "📚 Legal Reference: The lead manager(s) shall submit a statement certifying that all changes, suggestions and observations made by the Board have been incorporated in the..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "The issuer shall also file the draft offer document with the stock exchange(s) where the specified securities are proposed to be listed, and submit the Permanent Account Number, bank account number and passport number of its promoters (if individuals), or Permanent Account Number, bank account number, company registration number or equivalent and the address of the Registrar of Companies (if promoter is a body corporate), to the stock exchange(s).",
      "citation": "ICDR_2018 Chapter II Unit 25",
      "chapter": "Chapter II",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information regarding the filing of the draft offer document with stock exchanges or the submission of promoter details (PAN, bank account, passport number for individuals, or company registration and RoC address for corporate promoters). This is a mandatory legal obligation.",
      "evidence": "",
      "missing_details": "Filing of draft offer document with stock exchanges, Permanent Account Number of promoters (if individuals), bank account number of promoters (if individuals), passport number of promoters (if individuals), company registration number or equivalent of promoters (if body corporate), address of the Registrar of Companies for promoters (if body corporate)",
      "confidence": 1.0,
      "pages": [
        2,
        5,
        6
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: The issuer shall also file the draft offer document with the stock exchange(s) where the specified securities are proposed to be listed, and submit the Permanent Account Number, bank account number and passport number of its promoters (if individuals), or Permanent Account Number, bank account number, company registration number or equivalent and the address of the Registrar of Companies (if promoter is a body corporate), to the stock exchange(s).",
        "📋 Required details: Filing of draft offer document with stock exchanges, Permanent Account Number of promoters (if individuals), bank account number of promoters (if individuals), passport number of promoters (if individuals), company registration number or equivalent of promoters (if body corporate), address of the Registrar of Companies for promoters (if body corporate)",
        "📚 Legal Reference: The issuer shall also file the draft offer document with the stock exchange(s) where the specified securities are proposed to be listed, and submit th..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "The lead manager(s) shall call upon the issuer, its promoters and its directors or in case of an offer for sale, also the selling shareholders, to fulfil their obligations as disclosed by them in the draft offer document and the offer document and as required in terms of these regulations.",
      "citation": "ICDR_2018 Chapter II Unit 24",
      "chapter": "Chapter II",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information related to the lead manager's obligation to call upon the issuer, promoters, directors, or selling shareholders to fulfill their disclosed obligations. The content focuses on the business overview, operations, and dealer network.",
      "evidence": "",
      "missing_details": "Information regarding the lead manager's actions to ensure the issuer, promoters, directors, and selling shareholders fulfill their obligations as disclosed in the DRHP and required by regulations.",
      "confidence": 1.0,
      "pages": [
        1,
        4,
        10
      ],
      "priority": "CRITICAL",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: The lead manager(s) shall call upon the issuer, its promoters and its directors or in case of an offer for sale, also the selling shareholders, to fulfil their obligations as disclosed by them in the draft offer document and the offer document and as required in terms of these regulations.",
        "📋 Required details: Information regarding the lead manager's actions to ensure the issuer, promoters, directors, and selling shareholders fulfill their obligations as disclosed in the DRHP and required by regulations.",
        "📚 Legal Reference: The lead manager(s) shall call upon the issuer, its promoters and its directors or in case of an offer for sale, also the selling shareholders, to ful..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "Copy of the offer documents shall also be filed with the Board and the stock exchange(s) through the lead manager(s) promptly after filing the offer documents with Registrar of Companies.",
      "citation": "ICDR_2018 Chapter II Unit 25",
      "chapter": "Chapter II",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information regarding the filing of offer documents with SEBI (the Board) and stock exchanges, nor does it mention the role of lead managers in this process. The legal obligation requires prompt filing after submission to the Registrar of Companies, and this crucial procedural step is absent from the excerpt.",
      "evidence": "",
      "missing_details": "Confirmation of filing offer documents with SEBI, Confirmation of filing offer documents with stock exchanges, Details of lead manager's role in filing, Confirmation of prompt filing post-ROC submission",
      "confidence": 1.0,
      "pages": [
        1,
        2,
        6
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: Copy of the offer documents shall also be filed with the Board and the stock exchange(s) through the lead manager(s) promptly after filing the offer documents with Registrar of Companies.",
        "📋 Required details: Confirmation of filing offer documents with SEBI, Confirmation of filing offer documents with stock exchanges, Details of lead manager's role in filing, Confirmation of prompt filing post-ROC submission",
        "📚 Legal Reference: Copy of the offer documents shall also be filed with the Board and the stock exchange(s) through the lead manager(s) promptly after filing the offer d..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "In an issue made other than through the book building process, the allocation in the net offer category shall be remaining to other investors including corporate bodies or institutions, irrespective of the number of specified securities applied for.",
      "citation": "ICDR_2018 Chapter II Unit 32",
      "chapter": "Chapter II",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information regarding the allocation process for issues made other than through the book building process. Specifically, there is no mention of how the net offer category will be allocated to corporate bodies, institutions, or individual applicants other than retail individual investors.",
      "evidence": "",
      "missing_details": "Details on allocation in the net offer category for issues made other than through book building, specifically regarding corporate bodies, institutions, and individual applicants other than retail individual investors.",
      "confidence": 1.0,
      "pages": [
        1,
        4,
        6
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: In an issue made other than through the book building process, the allocation in the net offer category shall be remaining to other investors including corporate bodies or institutions, irrespective of the number of specified securities applied for.",
        "📋 Required details: Details on allocation in the net offer category for issues made other than through book building, specifically regarding corporate bodies, institutions, and individual applicants other than retail individual investors.",
        "📚 Legal Reference: In an issue made other than through the book building process, the allocation in the net offer category shall be remaining to other investors includin..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "The authorised employees of the designated stock exchange along with the lead manager(s) and registrars to the issue shall ensure that the basis of allotment is finalised in a fair and proper manner as may be prescribed by the Board.",
      "citation": "ICDR_2018 Chapter III Unit 90",
      "chapter": "Chapter III",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information related to the obligation of ensuring the basis of allotment is finalized in a fair and proper manner. This obligation pertains to the post-filing process and the responsibilities of the stock exchange, lead manager, and registrar, which are not detailed in the business overview or project execution sections.",
      "evidence": "",
      "missing_details": "Information regarding the process and responsibilities for finalizing the basis of allotment.",
      "confidence": 1.0,
      "pages": [
        1,
        6,
        10
      ],
      "priority": "CRITICAL",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: The authorised employees of the designated stock exchange along with the lead manager(s) and registrars to the issue shall ensure that the basis of allotment is finalised in a fair and proper manner as may be prescribed by the Board.",
        "📋 Required details: Information regarding the process and responsibilities for finalizing the basis of allotment.",
        "📚 Legal Reference: The lead manager(s) shall ensure availability of the offer document and other issue material including application forms to stock exchanges, syndicate..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "The abridged letter of offer, along with application form, shall be despatched through registered post or speed post or by courier service or by electronic transmission to all the existing shareholders at least three days before the date of opening of the issue.",
      "citation": "ICDR_2018 Chapter III Unit 76",
      "chapter": "Chapter III",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information related to the despatch of the abridged letter of offer and application form to existing shareholders. This legal obligation pertains to the post-filing and pre-opening of the issue phase, and the DRHP primarily focuses on the business overview, project execution, and financial metrics.",
      "evidence": "",
      "missing_details": "Details regarding the despatch of the abridged letter of offer and application form to existing shareholders, including the method of despatch (registered post, speed post, courier, or electronic transmission) and the timeline (at least three days before the opening of the issue).",
      "confidence": 1.0,
      "pages": [
        1,
        3,
        6
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: The abridged letter of offer, along with application form, shall be despatched through registered post or speed post or by courier service or by electronic transmission to all the existing shareholders at least three days before the date of opening of the issue.",
        "📋 Required details: Details regarding the despatch of the abridged letter of offer and application form to existing shareholders, including the method of despatch (registered post, speed post, courier, or electronic transmission) and the timeline (at least three days before the opening of the issue).",
        "📚 Legal Reference: In case of rights issue of size less than fifty crores rupees, the issuer shall prepare the letter of offer in accordance with requirements as specifi..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "In an issue made through the book building process under sub-regulation (1) of regulation 6, the allocation in the net offer category shall be no t more than fifty per cent. to qualified institutional buyers, five per cent. of which shall be allocated to mutual funds.",
      "citation": "ICDR_2018 Chapter II Unit 32",
      "chapter": "Chapter II",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information regarding the allocation of shares in the net offer category to qualified institutional buyers (QIBs), mutual funds, or any other category. The legal obligation pertains to the distribution of shares in an IPO made through the book building process, which is not addressed in the given excerpts.",
      "evidence": "",
      "missing_details": "Allocation details for Qualified Institutional Buyers (QIBs), Mutual Funds, and other categories in the net offer category as per sub-regulation (1) and (2) of regulation 6.",
      "confidence": 1.0,
      "pages": [
        2,
        3,
        5
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: In an issue made through the book building process under sub-regulation (1) of regulation 6, the allocation in the net offer category shall be no t more than fifty per cent. to qualified institutional buyers, five per cent. of which shall be allocated to mutual funds.",
        "📋 Required details: Allocation details for Qualified Institutional Buyers (QIBs), Mutual Funds, and other categories in the net offer category as per sub-regulation (1) and (2) of regulation 6.",
        "📚 Legal Reference: In an issue made through the book building process under sub-regulation (1) of regulation 6, the allocation in the net offer category shall be no t mo..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "The lead manager(s) shall call upon the issuer, its promoters and its directors to fulfil their obligations as disclosed by them in the draft letter of offer and letter of offer and as required in terms of these Regulations.",
      "citation": "ICDR_2018 Chapter III Unit 70(4)",
      "chapter": "Chapter III",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content discusses project execution, government tenders, vehicle conversion, and dealer networks. However, it does not contain any information related to the lead manager's obligation to call upon the issuer, promoters, directors, or selling shareholders to fulfill their disclosed obligations as required by the legal obligation. This specific compliance aspect is not addressed in the given excerpts.",
      "evidence": "",
      "missing_details": "Information regarding the lead manager's role in ensuring issuer, promoter, director, and selling shareholder obligations are met.",
      "confidence": 1.0,
      "pages": [
        4,
        6,
        10
      ],
      "priority": "CRITICAL",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: The lead manager(s) shall call upon the issuer, its promoters and its directors to fulfil their obligations as disclosed by them in the draft letter of offer and letter of offer and as required in terms of these Regulations.",
        "📋 Required details: Information regarding the lead manager's role in ensuring issuer, promoter, director, and selling shareholder obligations are met.",
        "📚 Legal Reference: The lead manager(s) shall call upon the issuer, its promoters and its directors or in case of an offer for sale, also the selling shareholders, to ful..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "In case the issuer opts for the alternate method of book building in terms of Part D of Schedule XIII , the issuer may offer the specified securities to its employees at a price not lower than by more than ten per cent. of the floor price.",
      "citation": "ICDR_2018 Chapter II Unit 30",
      "chapter": "Chapter II",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information regarding the issuer's intention to offer securities to employees or the pricing mechanism for such an offer, which is a requirement under the alternate method of book building. Therefore, compliance with this specific legal obligation cannot be determined.",
      "evidence": "",
      "missing_details": "Details on whether the issuer intends to offer securities to employees, and if so, the pricing methodology relative to the floor price as per Part D of Schedule XIII.",
      "confidence": 1.0,
      "pages": [
        4,
        7,
        10
      ],
      "priority": "CRITICAL",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: In case the issuer opts for the alternate method of book building in terms of Part D of Schedule XIII , the issuer may offer the specified securities to its employees at a price not lower than by more than ten per cent. of the floor price.",
        "📋 Required details: Details on whether the issuer intends to offer securities to employees, and if so, the pricing methodology relative to the floor price as per Part D of Schedule XIII.",
        "📚 Legal Reference: In case the issuer opts for the alternate method of book building in terms of Part D of Schedule XIII , the issuer may offer the specified securities ..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "In an issue made through the book building process under sub-regulation (2) of regulation 6, the allocation in the net offer category shall be not less than seventy five per cent. to qualified institutional buyers, five per cent. of which shall be allocated to mutual funds.",
      "citation": "ICDR_2018 Chapter II Unit 32",
      "chapter": "Chapter II",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information regarding the allocation of shares in the net offer category to qualified institutional buyers (QIBs) or mutual funds, which is a mandatory disclosure for book-built issues. Therefore, compliance with the legal obligation cannot be determined.",
      "evidence": "",
      "missing_details": "Details on the allocation percentage to Qualified Institutional Buyers (QIBs) and Mutual Funds in the net offer category for the book-building process.",
      "confidence": 1.0,
      "pages": [
        3,
        4,
        6
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: In an issue made through the book building process under sub-regulation (2) of regulation 6, the allocation in the net offer category shall be not less than seventy five per cent. to qualified institutional buyers, five per cent. of which shall be allocated to mutual funds.",
        "📋 Required details: Details on the allocation percentage to Qualified Institutional Buyers (QIBs) and Mutual Funds in the net offer category for the book-building process.",
        "📚 Legal Reference: In an issue made through the book building process under sub-regulation (2) of regulation 6, the allocation in the net offer category shall be not les..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "Shareholders making an application on plain paper shall not be entitled to renounce their rights and shall not utilise the application form for any purpose including re nunciation even if it is received subsequently.",
      "citation": "ICDR_2018 Chapter III Unit 78",
      "chapter": "Chapter III",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information related to the legal obligation concerning shareholders making applications on plain paper and their inability to renounce rights. This specific disclosure is not present in the sections provided.",
      "evidence": "",
      "missing_details": "Disclosure regarding the rights and restrictions for shareholders applying on plain paper, specifically concerning renunciation of rights.",
      "confidence": 1.0,
      "pages": [
        1,
        3,
        4
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: Shareholders making an application on plain paper shall not be entitled to renounce their rights and shall not utilise the application form for any purpose including re nunciation even if it is received subsequently.",
        "📋 Required details: Disclosure regarding the rights and restrictions for shareholders applying on plain paper, specifically concerning renunciation of rights.",
        "📚 Legal Reference: An issuer shall not be eligible to make an initial public offer if there are any outstanding convertible securities or any other right which would ent..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "Copy of the letter of offer shall also be filed with the Board and the stock exchanges through the lead manager simultaneously with filing of the letter of offer with the designated stock exchange.",
      "citation": "ICDR_2018 Chapter III Unit 71",
      "chapter": "Chapter III",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information regarding the filing of the letter of offer with SEBI and the stock exchanges through the lead manager. This is a critical procedural step that must be documented.",
      "evidence": "",
      "missing_details": "Confirmation of filing the letter of offer with SEBI and stock exchanges through the lead manager, including dates of filing and reference numbers.",
      "confidence": 1.0,
      "pages": [
        1,
        3,
        6
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: Copy of the letter of offer shall also be filed with the Board and the stock exchanges through the lead manager simultaneously with filing of the letter of offer with the designated stock exchange.",
        "📋 Required details: Confirmation of filing the letter of offer with SEBI and stock exchanges through the lead manager, including dates of filing and reference numbers.",
        "📚 Legal Reference: Copy of the offer documents shall also be filed with the Board and the stock exchange(s) through the lead manager(s) promptly after filing the offer d..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "it shall create a debenture redemption reserve in accordance with the provisions of the Companies Act, 2013 and rules made thereunder;",
      "citation": "ICDR_2018 Chapter II Unit 10",
      "chapter": "Chapter II",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information regarding the creation of a debenture redemption reserve or the appointment of a debenture trustee. These are crucial compliance requirements related to debenture issuance under the Companies Act, 2013, and SEBI regulations.",
      "evidence": "",
      "missing_details": "Details on the creation of a debenture redemption reserve as per the Companies Act, 2013 and rules made thereunder; Confirmation of appointment of at least one debenture trustee in accordance with the Companies Act, 2013 and SEBI (Debenture Trustees) Regulations, 1993.",
      "confidence": 1.0,
      "pages": [
        4,
        5,
        7
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: it shall create a debenture redemption reserve in accordance with the provisions of the Companies Act, 2013 and rules made thereunder;",
        "📋 Required details: Details on the creation of a debenture redemption reserve as per the Companies Act, 2013 and rules made thereunder; Confirmation of appointment of at least one debenture trustee in accordance with the Companies Act, 2013 and SEBI (Debenture Trustees) Regulations, 1993.",
        "📚 Legal Reference: it shall create a debenture redemption reserve in accordance with the provisions of the Companies Act, 2013 and rules made thereunder;..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "an issuer offering specified securities of aggregate value of 88[fifty crores] rupees or more, through a rights issue shall satisfy the conditions of this Chapter at the time of filing the draft letter of offer with the Board and also at the time of filing the final letter of offer with the stock exchanges, as the case may be.",
      "citation": "ICDR_2018 Chapter III Unit 60",
      "chapter": "Chapter III",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information related to the aggregate value of the rights issue or whether it meets the threshold of fifty crore rupees. Therefore, it is impossible to determine if the issuer is satisfying the legal obligation to verify conditions at the time of filing.",
      "evidence": "",
      "missing_details": "Aggregate value of the rights issue, Confirmation of compliance with Chapter conditions for rights issues of 50 crore rupees or more.",
      "confidence": 1.0,
      "pages": [
        1,
        3,
        6
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: an issuer offering specified securities of aggregate value of 88[fifty crores] rupees or more, through a rights issue shall satisfy the conditions of this Chapter at the time of filing the draft letter of offer with the Board and also at the time of filing the final letter of offer with the stock exchanges, as the case may be.",
        "📋 Required details: Aggregate value of the rights issue, Confirmation of compliance with Chapter conditions for rights issues of 50 crore rupees or more.",
        "📚 Legal Reference: In case of rights issue of size less than fifty crores rupees, the issuer shall prepare the letter of offer in accordance with requirements as specifi..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "Where the specified securities are not allotted and/or application monies are not refunded or unblocked within the period stipulated in sub-regulation (1) above, the issuer shall undertake to pay interest at the rate of fifteen per cent. per annum to the shareholders within such time as disclosed in the draft letter of offer and the letter of offer and the lead manager(s) shall ensure the same.",
      "citation": "ICDR_2018 Chapter III Unit 91",
      "chapter": "Chapter III",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information related to the issuer's obligation to pay interest on delayed allotment or refund of application monies. This specific legal obligation requires a commitment from the issuer regarding the rate of interest and the timeline for payment, which is absent in the given excerpts.",
      "evidence": "",
      "missing_details": "Undertaking to pay interest at the rate of fifteen per cent. per annum to the shareholders within such time as disclosed in the draft letter of offer and the letter of offer, and confirmation of lead manager(s) ensuring the same.",
      "confidence": 1.0,
      "pages": [
        1,
        6,
        10
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: Where the specified securities are not allotted and/or application monies are not refunded or unblocked within the period stipulated in sub-regulation (1) above, the issuer shall undertake to pay interest at the rate of fifteen per cent. per annum to the shareholders within such time as disclosed in the draft letter of offer and the letter of offer and the lead manager(s) shall ensure the same.",
        "📋 Required details: Undertaking to pay interest at the rate of fifteen per cent. per annum to the shareholders within such time as disclosed in the draft letter of offer and the letter of offer, and confirmation of lead manager(s) ensuring the same.",
        "📚 Legal Reference: The amount for general corporate purposes, and such objects where the issuer company has not identified acquisition or investment target, as mentioned..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "an updated pre-filed offer document or a fresh draft offer document under Chapter II or fresh pre-filed draft offer document, as the case may be, shall be filed with the Board along with fees specified in Schedule III",
      "citation": "ICDR_2018 Chapter II Unit 59E",
      "chapter": "Chapter II",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information related to the filing of an updated or fresh draft offer document with the Board, nor does it mention the associated fees as specified in Schedule III. The legal obligation requires the filing of such documents under specific circumstances (changes in Schedule XVI matters) or prior to an IPO, which is not addressed in the given excerpts.",
      "evidence": "",
      "missing_details": "Confirmation of filing an updated/fresh draft offer document with SEBI, details of fees paid as per Schedule III, confirmation of compliance with Schedule XVI requirements if applicable.",
      "confidence": 1.0,
      "pages": [
        1,
        4,
        6
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: an updated pre-filed offer document or a fresh draft offer document under Chapter II or fresh pre-filed draft offer document, as the case may be, shall be filed with the Board along with fees specified in Schedule III",
        "📋 Required details: Confirmation of filing an updated/fresh draft offer document with SEBI, details of fees paid as per Schedule III, confirmation of compliance with Schedule XVI requirements if applicable.",
        "📚 Legal Reference: If there are any changes in the draft offer document in relation to the matters specified in Schedule XVI, an updated offer document or a fresh draft ..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "An issue shall be opened after at least three working days from the date of filing, the red herring prospectus , in case of a book built issue and the prospectus, in case of a fixed price issue, with the Registrar of Companies.",
      "citation": "ICDR_2018 Chapter II Unit 44",
      "chapter": "Chapter II",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information regarding the filing date of the Red Herring Prospectus with the Registrar of Companies, nor does it mention the opening date of the issue. Therefore, it is impossible to determine if the legal obligation of opening the issue at least three working days after filing has been met.",
      "evidence": "",
      "missing_details": "Date of filing of Red Herring Prospectus with Registrar of Companies, Date of opening of the issue",
      "confidence": 1.0,
      "pages": [
        1,
        4,
        10
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: An issue shall be opened after at least three working days from the date of filing, the red herring prospectus , in case of a book built issue and the prospectus, in case of a fixed price issue, with the Registrar of Companies.",
        "📋 Required details: Date of filing of Red Herring Prospectus with Registrar of Companies, Date of opening of the issue",
        "📚 Legal Reference: An issue shall be opened after at least three working days from the date of filing, the red herring prospectus , in case of a book built issue and the..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "In case the promoters have to subscribe to equity shares or convertible securities towards minimum promoters’ contribution, the amount of promoters’ contribution shall be kept in an escrow account with a scheduled commercial bank, which shall be released to the issuer along with the release of the issue proceeds.",
      "citation": "ICDR_2018 Chapter II Unit 14",
      "chapter": "Chapter II",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information regarding the promoters' contribution to the minimum promoters' contribution, nor does it mention any escrow account arrangements for such contributions. Therefore, the legal obligation to verify the escrow account for promoters' contribution is not addressed in the given excerpts.",
      "evidence": "",
      "missing_details": "Details of promoters' contribution to minimum promoters' contribution, Confirmation of escrow account for promoters' contribution, Scheduled commercial bank where the escrow account is maintained, Release conditions for the escrow account.",
      "confidence": 1.0,
      "pages": [
        1,
        2,
        3
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: In case the promoters have to subscribe to equity shares or convertible securities towards minimum promoters’ contribution, the amount of promoters’ contribution shall be kept in an escrow account with a scheduled commercial bank, which shall be released to the issuer along with the release of the issue proceeds.",
        "📋 Required details: Details of promoters' contribution to minimum promoters' contribution, Confirmation of escrow account for promoters' contribution, Scheduled commercial bank where the escrow account is maintained, Release conditions for the escrow account.",
        "📚 Legal Reference: In case the promoters have to subscribe to equity shares or convertible securities towards minimum promoters’ contribution, the amount of promoters’ c..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "“pre-filed draft offer document” shall mean draft offer document filed with the Board under this Chapter",
      "citation": "ICDR_2018 Chapter II Unit 59A",
      "chapter": "Chapter II",
      "mandatory": true,
      "status": "INSUFFICIENT",
      "explanation": "The DRHP acknowledges the need for material disclosures to enable informed investment decisions and includes forward-looking statements with risk disclaimers. However, it lacks specific details regarding the nature and extent of these disclosures, particularly concerning the adequacy and truthfulness of all material information required for an informed investment decision. The provided snippets offer a glimpse into business operations and financial data but do not comprehensively demonstrate compliance with the 'true and adequate' disclosure requirement.",
      "evidence": "Some of the information in this section, including information with respect to our plans and strategies, contain forward – looking statements that involve risks and uncertainties. Before deciding to invest in the Equity Shares, Shareholders should read this Draft Red Herring Prospectus. An investment in the Equity Shares involves a high degree of risk. For a discussion of certain risks in connection with investments in the Equity Shares, you should read “Risk Factors” on page 2",
      "missing_details": "Confirmation of all material disclosures being true and adequate, specific details on how the DRHP enables informed investment decisions beyond risk factors, comprehensive financial data beyond limited figures, details on the business model's sustainability and competitive landscape.",
      "confidence": 0.7,
      "pages": [
        1,
        9,
        10
      ],
      "priority": "LOW",
      "recommendations": [
        "⚠️  ENHANCE: Current disclosure is incomplete",
        "📋 Add the following: Confirmation of all material disclosures being true and adequate, specific details on how the DRHP enables informed investment decisions beyond risk factors, comprehensive financial data beyond limited figures, details on the business model's sustainability and competitive landscape.",
        "📄 Current content location: Pages 1, 9, 10"
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "the issuer shall file updated draft red herring prospectus -I with the Board and the stock exchanges in terms of regulation 59 C of these regulations within sixteen months from the date of issuance of the observations by the Board",
      "citation": "ICDR_2018 Chapter II Unit 59E",
      "chapter": "Chapter II",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information related to the legal obligation of filing updated draft red herring prospectuses within sixteen months from the date of issuance of observations by the Board. This specific regulatory requirement is not addressed in the excerpts.",
      "evidence": "",
      "missing_details": "Information regarding the filing of updated draft red herring prospectuses within sixteen months from the date of issuance of observations by the Board as per regulation 59 C.",
      "confidence": 1.0,
      "pages": [
        1,
        3,
        10
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: the issuer shall file updated draft red herring prospectus -I with the Board and the stock exchanges in terms of regulation 59 C of these regulations within sixteen months from the date of issuance of the observations by the Board",
        "📋 Required details: Information regarding the filing of updated draft red herring prospectuses within sixteen months from the date of issuance of observations by the Board as per regulation 59 C.",
        "📚 Legal Reference: the red-herring prospectus, and prospectus shall contain disclosures specified in Part A of Schedule VI..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "The lead manager(s) shall ensure availability of the letter of offer and other issue material including a pplication forms with stock exchanges, registrar to issue, registrar and share transfer agents, depository participants, stock brokers, underwriters, bankers to the issue, investors‘ associations and self certified syndicate banks before the opening of the issue.",
      "citation": "ICDR_2018 Chapter III Unit 77",
      "chapter": "Chapter III",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content focuses on the business overview, project execution, and risk factors. It does not contain any information related to the lead manager's obligation to ensure the availability of the offer document and other issue material with various intermediaries before the opening of the issue. This specific legal obligation is not addressed in the given excerpts.",
      "evidence": "",
      "missing_details": "Confirmation of availability of letter of offer, application forms, and other issue material with stock exchanges, registrar to issue, registrar and share transfer agents, depository participants, stock brokers, underwriters, bankers to the issue, investors‘ associations, and self certified syndicate banks before the opening of the issue.",
      "confidence": 1.0,
      "pages": [
        1,
        4,
        6
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: The lead manager(s) shall ensure availability of the letter of offer and other issue material including a pplication forms with stock exchanges, registrar to issue, registrar and share transfer agents, depository participants, stock brokers, underwriters, bankers to the issue, investors‘ associations and self certified syndicate banks before the opening of the issue.",
        "📋 Required details: Confirmation of availability of letter of offer, application forms, and other issue material with stock exchanges, registrar to issue, registrar and share transfer agents, depository participants, stock brokers, underwriters, bankers to the issue, investors‘ associations, and self certified syndicate banks before the opening of the issue.",
        "📚 Legal Reference: The lead manager(s) shall ensure availability of the offer document and other issue material including application forms to stock exchanges, syndicate..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "In an issue made through the book building process under sub-regulation (1) of regulation 6, the allocation in the net offer category shall be not less than thirty five per cent. to retail individual investors.",
      "citation": "ICDR_2018 Chapter II Unit 32",
      "chapter": "Chapter II",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information regarding the allocation of shares in the net offer category to retail individual investors, which is a mandatory requirement for book-built issues. Therefore, it is impossible to determine if the legal obligation of allocating not less than thirty-five percent to retail individual investors is met.",
      "evidence": "",
      "missing_details": "Allocation details for retail individual investors in the net offer category, specifically the percentage or number of shares reserved for them.",
      "confidence": 1.0,
      "pages": [
        3,
        6,
        7
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: In an issue made through the book building process under sub-regulation (1) of regulation 6, the allocation in the net offer category shall be not less than thirty five per cent. to retail individual investors.",
        "📋 Required details: Allocation details for retail individual investors in the net offer category, specifically the percentage or number of shares reserved for them.",
        "📚 Legal Reference: In an issue made through the book building process under sub-regulation (1) of regulation 6, the allocation in the net offer category shall be not les..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "The lead manager(s) shall submit to the Board, the following documents along with the letter of offer: a due diligence certificate as per Form A of Schedule V including additional confirmations as specified in Form E of Schedule V.",
      "citation": "ICDR_2018 Chapter III Unit 100",
      "chapter": "Chapter III",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any mention of a due diligence certificate as per Form A of Schedule V, nor does it include any statements or confirmations related to the lead manager's submission of such documents to the Board. The legal obligations cited require specific submissions from the lead manager(s) that are absent in the given excerpts.",
      "evidence": "",
      "missing_details": "Due diligence certificate as per Form A of Schedule V, Additional confirmations as specified in Form E of Schedule V, Statement certifying incorporation of Board's suggestions, Certificate confirming agreement between issuer and lead manager(s), Due diligence certificate from debenture trustee as per Form B of Schedule V (if applicable)",
      "confidence": 1.0,
      "pages": [
        4,
        6,
        10
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: The lead manager(s) shall submit to the Board, the following documents along with the letter of offer: a due diligence certificate as per Form A of Schedule V including additional confirmations as specified in Form E of Schedule V.",
        "📋 Required details: Due diligence certificate as per Form A of Schedule V, Additional confirmations as specified in Form E of Schedule V, Statement certifying incorporation of Board's suggestions, Certificate confirming agreement between issuer and lead manager(s), Due diligence certificate from debenture trustee as per Form B of Schedule V (if applicable)",
        "📚 Legal Reference: The lead manager(s) shall submit a statement certifying that all changes, suggestions and observations made by the Board have been incorporated in the..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "The rights entitlements shall be credited to the demat account of the shareholders before the date of opening of the issue.",
      "citation": "ICDR_2018 Chapter III Unit 77A",
      "chapter": "Chapter III",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information regarding the credit of rights entitlements to demat accounts before the opening of the issue. This is a specific legal obligation that needs to be addressed in the IPO documentation.",
      "evidence": "",
      "missing_details": "Confirmation of credit of rights entitlements to demat accounts before the date of opening of the issue.",
      "confidence": 1.0,
      "pages": [
        1,
        3,
        4
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: The rights entitlements shall be credited to the demat account of the shareholders before the date of opening of the issue.",
        "📋 Required details: Confirmation of credit of rights entitlements to demat accounts before the date of opening of the issue.",
        "📚 Legal Reference: Unless otherwise provided, these regulations shall apply to a rights issue by a listed issuer where the aggregate value of the issue is fifty crore ru..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "The rights issue shall be kept open for subscription for a maximum period of thirty days",
      "citation": "ICDR_2018 Chapter III Unit 87",
      "chapter": "Chapter III",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information regarding the duration for which the rights issue will remain open for subscription. This is a critical piece of information required to assess compliance with the legal obligation that the rights issue shall be kept open for a maximum period of thirty days.",
      "evidence": "",
      "missing_details": "Duration for which the rights issue will remain open for subscription",
      "confidence": 1.0,
      "pages": [
        1,
        3,
        6
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: The rights issue shall be kept open for subscription for a maximum period of thirty days",
        "📋 Required details: Duration for which the rights issue will remain open for subscription",
        "📚 Legal Reference: During the period the issue is open for subscription, no advertisement shall be released giving an impression that the issue has been fully subscribed..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "In an issue made through the book building process under sub-regulation (2) of regulation 6, the allocation in the net offer category shall be not more than ten per cent. to retail individual investors.",
      "citation": "ICDR_2018 Chapter II Unit 32",
      "chapter": "Chapter II",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information regarding the allocation of shares to retail individual investors in the net offer category for an IPO made through the book building process. Therefore, it is impossible to determine if the legal obligations related to this allocation are met.",
      "evidence": "",
      "missing_details": "Details on the percentage allocation to retail individual investors in the net offer category for book-built issues.",
      "confidence": 1.0,
      "pages": [
        3,
        4,
        7
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: In an issue made through the book building process under sub-regulation (2) of regulation 6, the allocation in the net offer category shall be not more than ten per cent. to retail individual investors.",
        "📋 Required details: Details on the percentage allocation to retail individual investors in the net offer category for book-built issues.",
        "📚 Legal Reference: In an issue made through the book building process under sub-regulation (2) of regulation 6, the allocation in the net offer category shall be not mor..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "The issuer shall redeem the convertible debt instruments in terms of the letter of offer.",
      "citation": "ICDR_2018 Chapter III Unit 63",
      "chapter": "Chapter III",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information regarding the redemption of convertible debt instruments or the requirement to obtain a credit rating for such instruments. Therefore, this legal obligation is not addressed in the given excerpts.",
      "evidence": "",
      "missing_details": "Information on the redemption terms of convertible debt instruments, Confirmation of obtaining credit rating from at least one credit rating agency for convertible debt instruments.",
      "confidence": 1.0,
      "pages": [
        3,
        5,
        6
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: The issuer shall redeem the convertible debt instruments in terms of the letter of offer.",
        "📋 Required details: Information on the redemption terms of convertible debt instruments, Confirmation of obtaining credit rating from at least one credit rating agency for convertible debt instruments.",
        "📚 Legal Reference: The issuer shall redeem the convertible debt instruments in terms of the offer document...."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "The lead manager(s) shall ensure that the monies received in respect of the issue are released to the issuer in compliance with the provisions of Section 40 (3) of the Companies Act, 2013, as applicable.",
      "citation": "ICDR_2018 Chapter II Unit 53",
      "chapter": "Chapter II",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information related to the lead manager's obligation to ensure that monies received in respect of the issue are released to the issuer in compliance with Section 40(3) of the Companies Act, 2013. This section typically deals with the refund of application money if the minimum subscription is not received or if the allotment is not made within the prescribed time. The DRHP excerpts focus on project execution, financial metrics, and business overview, none of which address this specific compliance requirement.",
      "evidence": "",
      "missing_details": "Details regarding the process for releasing issue proceeds to the issuer, including timelines and conditions for release as per Section 40(3) of the Companies Act, 2013.",
      "confidence": 1.0,
      "pages": [
        1,
        3,
        6
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: The lead manager(s) shall ensure that the monies received in respect of the issue are released to the issuer in compliance with the provisions of Section 40 (3) of the Companies Act, 2013, as applicable.",
        "📋 Required details: Details regarding the process for releasing issue proceeds to the issuer, including timelines and conditions for release as per Section 40(3) of the Companies Act, 2013.",
        "📚 Legal Reference: The lead manager(s) shall ensure availability of the offer document and other issue material including application forms to stock exchanges, syndicate..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "the equity shares allotted to the employees shall be subject to the provisions of lock-in as specified under the Securities and Exchange Board of India (Share Based Employee Benefits and Sweat Equity) Regulations, 2021.",
      "citation": "ICDR_2018 Chapter II Unit 17",
      "chapter": "Chapter II",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information regarding the lock-in provisions for equity shares allotted to employees or promoters, as required by SEBI regulations. The document focuses on business overview and risk factors, but lacks the specific details needed to assess compliance with the stated legal obligations.",
      "evidence": "",
      "missing_details": "Details on lock-in provisions for equity shares allotted to employees as per SEBI (Share Based Employee Benefits and Sweat Equity) Regulations, 2021; Details on lock-in provisions for promoters/shareholders holding more than 20% pre-issue shareholding as per regulation 17 of SEBI (Share Based Employee Benefits and Sweat Equity) Regulations, 2021.",
      "confidence": 1.0,
      "pages": [
        1,
        4,
        5
      ],
      "priority": "CRITICAL",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: the equity shares allotted to the employees shall be subject to the provisions of lock-in as specified under the Securities and Exchange Board of India (Share Based Employee Benefits and Sweat Equity) Regulations, 2021.",
        "📋 Required details: Details on lock-in provisions for equity shares allotted to employees as per SEBI (Share Based Employee Benefits and Sweat Equity) Regulations, 2021; Details on lock-in provisions for promoters/shareholders holding more than 20% pre-issue shareholding as per regulation 17 of SEBI (Share Based Employee Benefits and Sweat Equity) Regulations, 2021.",
        "📚 Legal Reference: the equity shares allotted to the employees shall be subject to the provisions of lock-in as specified under the Securities and Exchange Board of Indi..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "in case of a fast track issue of convertible debt instruments, a due diligence certificate from the debenture trustee as per Form B of Schedule V.",
      "citation": "ICDR_2018 Chapter III Unit 100",
      "chapter": "Chapter III",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information related to a due diligence certificate from a debenture trustee as per Form B of Schedule V, which is a mandatory requirement for fast-track issues of convertible debt instruments. The content focuses on financial metrics, operational details, and customer relationships, but not on the specific compliance documentation required for debt issuance.",
      "evidence": "",
      "missing_details": "Due diligence certificate from the debenture trustee as per Form B of Schedule V",
      "confidence": 1.0,
      "pages": [
        3,
        6,
        10
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: in case of a fast track issue of convertible debt instruments, a due diligence certificate from the debenture trustee as per Form B of Schedule V.",
        "📋 Required details: Due diligence certificate from the debenture trustee as per Form B of Schedule V",
        "📚 Legal Reference: The lead manager(s) shall submit a certificate confirming an agreement between the issuer and lead manager(s), a due diligence certificate as per Form..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "The draft letter of offer and letter of offer shall contain all material disclosures which are true and adequate to enable the applicants to take an informed investment decision.",
      "citation": "ICDR_2018 Chapter III Unit 70(1)",
      "chapter": "Chapter III",
      "mandatory": true,
      "status": "INSUFFICIENT",
      "explanation": "The DRHP acknowledges the need for material disclosures and directs readers to risk factors. It also presents financial data and operational details. However, it does not explicitly state that all material disclosures are true and adequate for an informed investment decision, nor does it provide full disclosures of conversion or exchange terms as required by Legal Requirement 2. The information provided is a starting point but lacks the explicit confirmation and comprehensive details needed to fully satisfy the obligations.",
      "evidence": "Some of the information in this section, including information with respect to our plans and strategies, contain forward – looking statements that involve risks and uncertainties. Before deciding to invest in the Equity Shares, Shareholders should read this Draft Red Herring Prospectus. An investment in the Equity Shares involves a high degree of risk. For a discussion of certain risks in connection with investments in the Equity Shares, you should read “Risk Factors” on page 2",
      "missing_details": "Explicit statement confirming all material disclosures are true and adequate for informed investment decisions, Full disclosures of the terms of conversion or exchange",
      "confidence": 0.8,
      "pages": [
        1,
        3,
        10
      ],
      "priority": "LOW",
      "recommendations": [
        "⚠️  ENHANCE: Current disclosure is incomplete",
        "📋 Add the following: Explicit statement confirming all material disclosures are true and adequate for informed investment decisions, Full disclosures of the terms of conversion or exchange",
        "📄 Current content location: Pages 1, 3, 10"
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "it has appointed at least one debenture trustee in accordance with the provisions of the Companies Act, 2013 and the Securities and Exchange Board of India (Debenture Trustees) Regulations, 1993;",
      "citation": "ICDR_2018 Chapter II Unit 10",
      "chapter": "Chapter II",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information regarding the appointment of a debenture trustee, which is a mandatory legal obligation under the Companies Act, 2013 and SEBI (Debenture Trustees) Regulations, 1993. Therefore, compliance with this obligation cannot be determined from the given excerpts.",
      "evidence": "",
      "missing_details": "Confirmation of appointment of at least one debenture trustee, details of the appointed debenture trustee(s) including their name, registration details with SEBI, and the date of appointment.",
      "confidence": 1.0,
      "pages": [
        2,
        4,
        5
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: it has appointed at least one debenture trustee in accordance with the provisions of the Companies Act, 2013 and the Securities and Exchange Board of India (Debenture Trustees) Regulations, 1993;",
        "📋 Required details: Confirmation of appointment of at least one debenture trustee, details of the appointed debenture trustee(s) including their name, registration details with SEBI, and the date of appointment.",
        "📚 Legal Reference: it has appointed at least one debenture trustee in accordance with the provisions of the Companies Act, 2013 and the Securities and Exchange Board of ..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "If the specified securities are locked-in in terms of clause (a) of regulation 16, the loan has been granted to the issuer company or its subsidiary(ies) for the purpose of financing one or more of the objects of the issue and pledge of specified securities is one of the terms of sanction of the loan.",
      "citation": "ICDR_2018 Chapter II Unit 21",
      "chapter": "Chapter II",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information related to locked-in securities, loans granted to the issuer or its subsidiaries for financing objects of the issue, or the pledge of specified securities as a term of loan sanction. Therefore, the legal obligation is not addressed.",
      "evidence": "",
      "missing_details": "Information regarding locked-in securities as per regulation 16(a) or 16(b), details of loans granted to the issuer or its subsidiaries for financing objects of the issue, and confirmation if the pledge of specified securities is a term of loan sanction.",
      "confidence": 1.0,
      "pages": [
        3,
        4,
        5
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: If the specified securities are locked-in in terms of clause (a) of regulation 16, the loan has been granted to the issuer company or its subsidiary(ies) for the purpose of financing one or more of the objects of the issue and pledge of specified securities is one of the terms of sanction of the loan.",
        "📋 Required details: Information regarding locked-in securities as per regulation 16(a) or 16(b), details of loans granted to the issuer or its subsidiaries for financing objects of the issue, and confirmation if the pledge of specified securities is a term of loan sanction.",
        "📚 Legal Reference: If the specified securities are locked-in in terms of clause (a) of regulation 16, the loan has been granted to the issuer company or its subsidiary(i..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "If the issuer making an initial public offer, other than through the book building process, desires to have the issue underwritten, it shall appoint merchant bankers or stock brokers, registered with the Board, to act as underwriters.",
      "citation": "ICDR_2018 Chapter II Unit 40(1)",
      "chapter": "Chapter II",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content focuses on the issuer's business operations, project execution, and revenue breakdown. There is no information related to underwriting arrangements, the appointment of merchant bankers or stock brokers as underwriters, or the execution of underwriting agreements, which are required for IPOs not using the book building process.",
      "evidence": "",
      "missing_details": "Details regarding the appointment of merchant bankers or stock brokers as underwriters, confirmation of an underwriting agreement, and the number of specified securities to be subscribed by underwriters on account of rejection of applications.",
      "confidence": 1.0,
      "pages": [
        4,
        6,
        7
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: If the issuer making an initial public offer, other than through the book building process, desires to have the issue underwritten, it shall appoint merchant bankers or stock brokers, registered with the Board, to act as underwriters.",
        "📋 Required details: Details regarding the appointment of merchant bankers or stock brokers as underwriters, confirmation of an underwriting agreement, and the number of specified securities to be subscribed by underwriters on account of rejection of applications.",
        "📚 Legal Reference: If the issuer making an initial public offer, other than through the book building process, desires to have the issue underwritten, it shall appoint m..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "The issuer shall, in case of an issue made through the book building process, appoint syndicate member(s) and in the case of any other issue, appoint bankers to issue, at centres in the manner specified in Schedule XII.",
      "citation": "ICDR_2018 Chapter II Unit 23",
      "chapter": "Chapter II",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information regarding the appointment of syndicate members or bankers to the issue, which is a mandatory requirement for an IPO. The content focuses on the business overview, project execution, and government customer tenders.",
      "evidence": "",
      "missing_details": "Appointment of syndicate member(s) for book building process or bankers to issue for other issues, as specified in Schedule XII.",
      "confidence": 1.0,
      "pages": [
        1,
        4,
        6
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: The issuer shall, in case of an issue made through the book building process, appoint syndicate member(s) and in the case of any other issue, appoint bankers to issue, at centres in the manner specified in Schedule XII.",
        "📋 Required details: Appointment of syndicate member(s) for book building process or bankers to issue for other issues, as specified in Schedule XII.",
        "📚 Legal Reference: The issuer shall, in case of an issue made through the book building process, appoint syndicate member(s) and in the case of any other issue, appoint ..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "The issuer shall announce a record date for the purpose of determining the shareholders eligible to apply for specified securities in the proposed rights issue for such period as may be specified in the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations, 2015.",
      "citation": "ICDR_2018 Chapter III Unit 68",
      "chapter": "Chapter III",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information related to the announcement of a record date for a rights issue. The legal obligation requires the issuer to announce a record date for determining eligible shareholders for a rights issue. This information is entirely absent from the given excerpts.",
      "evidence": "",
      "missing_details": "Announcement of a record date for determining shareholders eligible to apply for specified securities in the proposed rights issue.",
      "confidence": 1.0,
      "pages": [
        1,
        3,
        10
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: The issuer shall announce a record date for the purpose of determining the shareholders eligible to apply for specified securities in the proposed rights issue for such period as may be specified in the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations, 2015.",
        "📋 Required details: Announcement of a record date for determining shareholders eligible to apply for specified securities in the proposed rights issue.",
        "📚 Legal Reference: Unless otherwise provided in this Chapter, an issuer making an initial public offer of specified securities shall satisfy the conditions of this Chapt..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "In the letter of offer and the abridged letter of offer, the issuer shall disclose the process of credit of rights entitlements in the demat account and renunciation thereof.",
      "citation": "ICDR_2018 Chapter III Unit 70(7)",
      "chapter": "Chapter III",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided excerpts from the DRHP do not contain any information regarding the process of credit of rights entitlements in the demat account or the renunciation thereof. This is a mandatory disclosure requirement for the letter of offer and abridged letter of offer.",
      "evidence": "",
      "missing_details": "Disclosure of the process of credit of rights entitlements in the demat account, Disclosure of the process of renunciation of rights entitlements.",
      "confidence": 1.0,
      "pages": [
        3,
        4,
        6
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: In the letter of offer and the abridged letter of offer, the issuer shall disclose the process of credit of rights entitlements in the demat account and renunciation thereof.",
        "📋 Required details: Disclosure of the process of credit of rights entitlements in the demat account, Disclosure of the process of renunciation of rights entitlements.",
        "📚 Legal Reference: In case of rights issue of size less than fifty crores rupees, the issuer shall prepare the letter of offer in accordance with requirements as specifi..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "The monitoring agency shall submit its report to the issuer in the format specified in Schedule XI on a quarterly basis, till hundred per cent. of the proceeds of the issue actually raised have been utilised.",
      "citation": "ICDR_2018 Chapter III Unit 82",
      "chapter": "Chapter III",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information regarding the appointment of a monitoring agency, the format of its reports (Schedule XI), or the process of submitting and disseminating these reports. Therefore, the legal obligation to verify the utilization of IPO proceeds through a monitoring agency's report is not addressed.",
      "evidence": "",
      "missing_details": "Appointment of a monitoring agency, details of the monitoring agency's report format as per Schedule XI, quarterly reporting schedule, and public dissemination process of monitoring agency reports.",
      "confidence": 1.0,
      "pages": [
        3,
        6,
        10
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: The monitoring agency shall submit its report to the issuer in the format specified in Schedule XI on a quarterly basis, till hundred per cent. of the proceeds of the issue actually raised have been utilised.",
        "📋 Required details: Appointment of a monitoring agency, details of the monitoring agency's report format as per Schedule XI, quarterly reporting schedule, and public dissemination process of monitoring agency reports.",
        "📚 Legal Reference: The monitoring agency shall submit its report to the issuer in the format specified in Schedule XI on a quarterly basis, till hundred per cent. of the..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "In an issue made through the book building process under sub-regulation (1) of regulation 6, the allocation in the net offer category shall be not less than fifteen per cent. to non-institutional investors.",
      "citation": "ICDR_2018 Chapter II Unit 32",
      "chapter": "Chapter II",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information regarding the allocation of shares in the net offer category to non-institutional investors. The legal obligation requires a specific percentage (not less than 15% or not more than 15% depending on the regulation cited) to be allocated to this category in a book-building process. This crucial detail is absent from the provided text.",
      "evidence": "",
      "missing_details": "Allocation percentage for non-institutional investors in the net offer category",
      "confidence": 1.0,
      "pages": [
        3,
        4,
        6
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: In an issue made through the book building process under sub-regulation (1) of regulation 6, the allocation in the net offer category shall be not less than fifteen per cent. to non-institutional investors.",
        "📋 Required details: Allocation percentage for non-institutional investors in the net offer category",
        "📚 Legal Reference: In an issue made through the book building process under sub-regulation (1) of regulation 6, the allocation in the net offer category shall be not les..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "the lead manager(s) shall ensure the payment of interest at the rate of fifteen per cent. per annum to the shareholders within such time as disclosed in the draft letter of offer and the letter of offer.",
      "citation": "ICDR_2018 Chapter III Unit 91",
      "chapter": "Chapter III",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information regarding the lead manager's obligation to ensure the payment of interest at the rate of fifteen per cent. per annum to shareholders within a specified time. This specific legal obligation is not addressed in the excerpts.",
      "evidence": "",
      "missing_details": "Details on the rate of interest payable to shareholders, the timeframe for such payment, and confirmation of the lead manager's role in ensuring this obligation.",
      "confidence": 1.0,
      "pages": [
        1,
        6,
        10
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: the lead manager(s) shall ensure the payment of interest at the rate of fifteen per cent. per annum to the shareholders within such time as disclosed in the draft letter of offer and the letter of offer.",
        "📋 Required details: Details on the rate of interest payable to shareholders, the timeframe for such payment, and confirmation of the lead manager's role in ensuring this obligation.",
        "📚 Legal Reference: The lead manager(s) shall call upon the issuer, its promoters and its directors or in case of an offer for sale, also the selling shareholders, to ful..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "if the issue proposes to create a charge or security on its assets in respect of secured convertible debt instruments, it shall ensure that where security is already created on such assets in favour of any existing lender or security trustee or the issue of convertible debt instruments is proposed to be secured by creation of security on a leasehold land, the consent of such lender or security trustee or lessor for a second or pari passu charge has been obtained and submitted to the debenture trustee before the opening of the issue",
      "citation": "ICDR_2018 Chapter III Unit 63",
      "chapter": "Chapter III",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information regarding the creation of charges or security on assets for secured convertible debt instruments. Therefore, it is impossible to determine if the issuer has obtained the necessary consents from existing lenders or lessors for second or pari passu charges, or if the security cover has been calculated after reducing prior liabilities.",
      "evidence": "",
      "missing_details": "Details on any proposed charges or security for convertible debt instruments, consent from existing lenders/lessors for second/pari passu charges, and calculation of security cover after reduction of prior liabilities.",
      "confidence": 1.0,
      "pages": [
        1,
        3,
        6
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: if the issue proposes to create a charge or security on its assets in respect of secured convertible debt instruments, it shall ensure that where security is already created on such assets in favour of any existing lender or security trustee or the issue of convertible debt instruments is proposed to be secured by creation of security on a leasehold land, the consent of such lender or security trustee or lessor for a second or pari passu charge has been obtained and submitted to the debenture trustee before the opening of the issue",
        "📋 Required details: Details on any proposed charges or security for convertible debt instruments, consent from existing lenders/lessors for second/pari passu charges, and calculation of security cover after reduction of prior liabilities.",
        "📚 Legal Reference: if the issuer proposes to create a charge or security on its assets in respect of secured convertible debt instruments, it shall ensure that where sec..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    },
    {
      "obligation": "In an issue made other than through the book building process, the allocation in the net offer category shall be remaining to individual applicants other than retail individual investors.",
      "citation": "ICDR_2018 Chapter II Unit 32",
      "chapter": "Chapter II",
      "mandatory": true,
      "status": "MISSING",
      "explanation": "The provided DRHP content does not contain any information regarding the allocation of shares in the net offer category for issues made other than through the book building process. Specifically, it does not address how the remaining allocation after retail individual investors will be distributed among other individual applicants or other investors like corporate bodies or institutions.",
      "evidence": "",
      "missing_details": "Allocation details for the net offer category for issues made other than through the book building process, specifying distribution to individual applicants other than retail individual investors and other investors including corporate bodies or institutions.",
      "confidence": 1.0,
      "pages": [
        1,
        4,
        6
      ],
      "priority": "HIGH",
      "recommendations": [
        "⚠️  IMMEDIATE ACTION: Add complete disclosure for: In an issue made other than through the book building process, the allocation in the net offer category shall be remaining to individual applicants other than retail individual investors.",
        "📋 Required details: Allocation details for the net offer category for issues made other than through the book building process, specifying distribution to individual applicants other than retail individual investors and other investors including corporate bodies or institutions.",
        "📚 Legal Reference: In an issue made other than through the book building process, the allocation in the net offer category shall be remaining to individual applicants ot..."
      ],
      "agent_path": [
        "INITIALIZED",
        "RETRIEVAL",
        "ANALYSIS",
        "VALIDATION",
        "SYNTHESIS"
      ],
      "reanalysis_count": 0
    }
  ],
  "nse_queries": [
    {
      "title": "the red-herring prospectus, and prospectus shall contain disclosures s",
      "full_query": "**Insufficient Disclosure of Financial Information**\n\nOn page 1, \"...estated Consolidated Financial Statements and other information relating to our business and operations included in this Draft Red Herring Prospectus. Unless the context otherwise requires, in relation to business operations, in this chapter of this Prospectus, all references to “We”, “Us”, “Our” and “Our Company” are to Eco Fuel Systems (India) Limited as the case may be. OVERVIEW We are an alternative fuel systems company based in India offering trading, distribution, retrofitment, kit integra...\" However, the following information is missing: Full disclosures as specified in the Companies Act, 2013 and Part A of Schedule VI, including but not limited to, financial statements, management discussion and analysis, details of promoters, directors, objects of the issue, risk factors, etc. Furthermore, an AMOUNT_CONFLICT was noted on pages 1 and 5, with figures ₹8,102.62 Lakhs, ₹7,572.38 Lakhs, and ₹4,702.39 Lakhs appearing without clear reconciliation.\n\nRecommendation: Kindly provide complete financial statements, management discussion and analysis, details of promoters, directors, objects of the issue, and risk factors as mandated by the Companies Act, 2013 and Part A of Schedule VI. Kindly also reconcile the conflicting financial figures noted on pages 1 and 5.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\n[Severity]: Page 1\n\n**Insufficient Disclosure of Financial Information**\n\nOn page 7, the DRHP mentions \"...estated Consolidated Financial Statements and other information relating to our business and operations included in this Draft Red Herring Prospectus. Unless the context otherwise requires, in relation to business operations, in this chapter of this Prospectus, all references to “We”, “Us”, “Our” and “Our Company” are to Eco Fuel Systems (India) Limited as the case may be. OVERVIEW We are an alternative fuel systems company based in India offering trading, distribution, retrofitment, kit integra...\". However, the following information is missing: Full disclosures as specified in the Companies Act, 2013 and Part A of Schedule VI, including but not limited to, financial statements, management discussion and analysis, details of promoters, directors, objects of the issue, risk factors, etc.\n\nRecommendation: Kindly provide complete financial statements, management discussion and analysis, details of promoters, directors, objects of the issue, and risk factors as mandated by the Companies Act, 2013 and Part A of Schedule VI.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\n[Severity]: Page 7\n\n**Insufficient Disclosure of Financial Information**\n\nOn page 10, the DRHP mentions \"...estated Consolidated Financial Statements and other information relating to our business and operations included in this Draft Red Herring Prospectus. Unless the context otherwise requires, in relation to business operations, in this chapter of this Prospectus, all references to “We”, “Us”, “Our” and “Our Company” are to Eco Fuel Systems (India) Limited as the case may be. OVERVIEW We are an alternative fuel systems company based in India offering trading, distribution, retrofitment, kit integra...\". However, the following information is missing: Full disclosures as specified in the Companies Act, 2013 and Part A of Schedule VI, including but not limited to, financial statements, management discussion and analysis, details of promoters, directors, objects of the issue, risk factors, etc.\n\nRecommendation: Kindly provide complete financial statements, management discussion and analysis, details of promoters, directors, objects of the issue, and risk factors as mandated by the Companies Act, 2013 and Part A of Schedule VI.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\n[Severity]: Page 10",
      "page": "1",
      "severity": "Major",
      "regulation": "SEBI (ICDR) Regulations, 2018",
      "status": "INSUFFICIENT",
      "obligation": "the red-herring prospectus, and prospectus shall contain disclosures specified in the Companies Act, 2013"
    },
    {
      "title": "[Abridged Letter of Offer Disclosures]",
      "full_query": "[Abridged Letter of Offer Disclosures]\nOn page 1, it has been observed that Eco Fuel Systems (India) Limited has not disclosed the abridged letter of offer content as specified by the Board in Part F of Schedule VI. This is a mandatory disclosure requirement for the abridged letter of offer. Furthermore, there is an AMOUNT_CONFLICT on pages 1 and 5, indicating potential inconsistencies in financial figures.\n\nRecommendation: Kindly provide the complete abridged letter of offer content as per Part F of Schedule VI and resolve the identified AMOUNT_CONFLICT on pages 1 and 5.\n\nRegulation Ref: Regulation 31, Schedule VIII\n\n[CRITICAL]: Page 1",
      "page": "1",
      "severity": "Major",
      "regulation": "Regulation 31, Schedule VIII",
      "status": "MISSING",
      "obligation": "The abridged letter of offer shall contain the disclosures as specified by the Board in Part F of Schedule VI."
    },
    {
      "title": "**Disclosure Requirements - Part A of Schedule VI**",
      "full_query": "**Disclosure Requirements - Part A of Schedule VI**\nOn page 1, \"... India. We import our alternative fuel kits from Landi Renzo SpA, a globally recognized company based in Italy, which manufactures and sells alternative fuel kits under the LOVATO brand. Since the commencement of our operations, we have maintained a partnership with Landi Renzo SpA through a long-term sole distribution agreement that allows us to market and sell LPG, CNG, and LNG conversion kits in India. We also procure empty cylinders and other ancillary components from domestic and internatio...\". It has been observed that Eco Fuel Systems (India) Limited has not disclosed the disclosures specified in Part A of Schedule VI and the disclosures specified in the Companies Act, 2013. Additionally, there is an AMOUNT_CONFLICT on pages 1 and 5.\n\nRecommendation: Kindly ensure that all disclosures specified in Part A of Schedule VI and the Companies Act, 2013 are comprehensively included in the Red Herring Prospectus and Prospectus. Kindly also resolve the AMOUNT_CONFLICT identified on pages 1 and 5.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\nCRITICAL: Page 1",
      "page": "1",
      "severity": "Major",
      "regulation": "SEBI (ICDR) Regulations, 2018",
      "status": "MISSING",
      "obligation": "the red-herring prospectus, and prospectus shall contain disclosures specified in Part A of Schedule VI"
    },
    {
      "title": "[Promoter's Contribution Documentation]",
      "full_query": "[Promoter's Contribution Documentation]\nOn page [1], it has been observed that Eco Fuel Systems (India) Limited has not disclosed the following mandatory documents: a statement certifying that all changes, suggestions and observations made by the Board have been incorporated in the offer document, a due diligence certificate as per Form C of Schedule V, a copy of the resolution passed by the board of directors of the issuer for allotting specified securities to promoter(s) towards amount received against promoters’ contribution, a certificate from a statutory auditor certifying promoters’ contribution, and a due diligence certificate as per Form D of Schedule V (if applicable).\n\nRecommendation: Kindly submit all the aforementioned mandatory documents.\n\nRegulation Ref: Regulation 31, Schedule VIII\n\n[Severity]: Critical Page [1]",
      "page": "1",
      "severity": "Critical",
      "regulation": "Regulation 31, Schedule VIII",
      "status": "MISSING",
      "obligation": "The lead manager(s) shall submit a statement certifying that all changes, suggestions and observations made by the Board have been incorporated in the offer document, a due diligence certificate as per Form C of Schedule V, a copy of the resolution passed by the board of directors of the issuer for allotting specified securities to promoter(s) towards amount received against promoters’ contribution, a certificate from a statutory auditor certifying promoters’ contribution, and a due diligence certificate as per Form D of Schedule V (if applicable), to the Board after issuance of observations by the Board or after expiry of the period stipulated in sub-regulation (4) if the Board has not issued observations."
    },
    {
      "title": "The promoters, or shareholders in control of an issuer, shall provide ",
      "full_query": "**Exit Offer for Dissenting Shareholders**\n\nOn page [1], it has been observed that Eco Fuel Systems (India) Limited has not disclosed the details of the exit offer mechanism for dissenting shareholders, the conditions and manner of providing such exit offers as per Schedule XX, and information on promoters' or controlling shareholders' obligations regarding such exit offers. This is in contravention of the obligation to provide an exit offer to dissenting shareholders in case of change in objects or variation in the terms of contract related to objects referred to in the offer document.\n\nRecommendation: Kindly provide the complete details of the exit offer mechanism for dissenting shareholders, including the conditions and manner of its provision as stipulated in Schedule XX, and clearly outline the obligations of the promoters or controlling shareholders in this regard.\n\nRegulation Ref: Regulation 2(1)(oo), 31\n\n[Severity]: Page [1]",
      "page": "1",
      "severity": "Critical",
      "regulation": "Regulation 2(1)(oo), 31",
      "status": "MISSING",
      "obligation": "The promoters, or shareholders in control of an issuer, shall provide an exit offer to dissenting shareholders as provided for in the Companies Act, 2013, in case of change in objects or variation in the terms of contract related to objects referred to in the offer document as per conditions and manner is provided in Schedule XX"
    },
    {
      "title": "Except for anything contrary provided in this Chapter, the provisions ",
      "full_query": "**Minimum Offer to Public Compliance**\n\nOn page 1, \"Unless the context otherwise requires, in relation to business operations, in this chapter of this Prospectus, all references to “We”, “Us”, “Our” and “Our Company” are to Eco Fuel Systems (India) Limited as the case may be. OVERVIEW We are an alternative fuel systems company based in India offering trading, distribution, retr...\". However, the following information is missing: Details regarding the minimum offer to the public and its compliance with Rule 19(2)(b) of the Securities Contracts (Regulations) Rules, 1957.\n\nRecommendation: Kindly provide the details regarding the minimum offer to the public and demonstrate compliance with Rule 19(2)(b) of the Securities Contracts (Regulations) Rules, 1957.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\n[Severity]: Page 1\n\n**Amount Conflict in Financials**\n\nOn page 1, ₹8,102.62 Lakhs. There is an amount conflict observed between page 1 and page 5, where a different figure is presented.\n\nRecommendation: Kindly reconcile the conflicting figures and ensure consistency across all relevant pages.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\n[Severity]: Page 1, Page 5",
      "page": "1",
      "severity": "Major",
      "regulation": "SEBI (ICDR) Regulations, 2018",
      "status": "MISSING",
      "obligation": "Except for anything contrary provided in this Chapter, the provisions of Chapter -II shall mutatis mutandis apply in relation to the initial public offer made under the provisions of this Chapter."
    },
    {
      "title": "The lead manager(s) shall exercise due diligence and satisfy themselve",
      "full_query": "**Due Diligence on Business Operations and Financial Disclosures**\n\nOn page 1, \"Eco fuel oversees the conversion of the fleet. This process includes: 1. Installation of Alternate fuel kits by our technical experts. 2. Regular training sessions for the client’s team on kit maintenance. 3. Resolution of technical issues post-installation. B. Government Customers Tender Process to Government Customers: Our company actively participates in tenders floated by government bodies for the procurement and installation of Alternative fuel kits in various vehicles used for public tran...\" However, the following information is missing: A detailed breakdown of the revenue generated from each of these operational aspects (installation, training, issue resolution) and from government tenders versus private sector clients. Furthermore, the DRHP mentions figures of ₹8,102.62 Lakhs, ₹7,572.38 Lakhs, and ₹4,702.39 Lakhs, and there is an AMOUNT_CONFLICT on pages [1, 5]. The lead manager's due diligence process to verify the veracity and adequacy of these disclosures, particularly concerning the revenue streams and the identified amount conflicts, is not adequately demonstrated.\n\nRecommendation: Kindly provide a detailed explanation of the lead manager's due diligence process undertaken to verify the accuracy and completeness of the business operations description and the financial figures presented, including the resolution of the AMOUNT_CONFLICT on pages [1, 5].\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\n[Severity]: Page 1\n\n**Due Diligence on Financial Information and Cross-Page Consistency**\n\nOn page 6, the DRHP mentions figures of ₹8,102.62 Lakhs, ₹7,572.38 Lakhs, and ₹4,702.39 Lakhs. However, there is an AMOUNT_CONFLICT on pages [1, 5]. The lead manager's due diligence process to ensure the consistency and accuracy of these financial figures across different sections of the DRHP, and to satisfy themselves about their veracity, is not sufficiently detailed.\n\nRecommendation: Kindly provide a detailed explanation of the lead manager's due diligence process undertaken to verify the accuracy and consistency of the financial figures presented, specifically addressing and resolving the AMOUNT_CONFLICT identified on pages [1, 5].\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\n[Severity]: Page 6\n\n**Due Diligence on Risk Factor Verification**\n\nOn page 10, the DRHP outlines certain aspects of Eco Fuel Systems (India) Limited's business operations. However, it has been observed that Eco Fuel Systems (India) Limited has not disclosed a comprehensive list of potential risks associated with its business model, particularly concerning the reliance on government tenders and the installation and maintenance of alternative fuel kits. The lead manager's due diligence process to identify and assess these risks, and to ensure their adequate disclosure, is not sufficiently demonstrated.\n\nRecommendation: Kindly provide a detailed explanation of the lead manager's due diligence process undertaken to identify, assess, and ensure the adequate disclosure of all material risk factors pertaining to Eco Fuel Systems (India) Limited's business operations.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\n[Severity]: Page 10",
      "page": "1",
      "severity": "Major",
      "regulation": "SEBI (ICDR) Regulations, 2018",
      "status": "INSUFFICIENT",
      "obligation": "The lead manager(s) shall exercise due diligence and satisfy themselves about all aspects of the issue including the veracity and adequacy of disclosure in the draft letter of offer and the letter of offer."
    },
    {
      "title": "[Statement of Compliance with Board Observations]",
      "full_query": "[Statement of Compliance with Board Observations]\nOn page 1, it has been observed that Eco Fuel Systems (India) Limited has not disclosed the statement certifying that all changes, suggestions, and observations made by the Board have been incorporated in the letter of offer, as required by Regulation 31 and Schedule VIII. This statement is crucial for demonstrating compliance with the Board's feedback post-observation issuance or expiry of the stipulated period.\n\nRecommendation: Kindly submit the statement certifying the incorporation of the Board's suggestions and observations.\n\nRegulation Ref: Regulation 31, Schedule VIII\n\n[Severity]: Critical Page 1",
      "page": "1",
      "severity": "Major",
      "regulation": "Regulation 31, Schedule VIII",
      "status": "MISSING",
      "obligation": "The lead manager(s) shall submit a statement certifying that all changes, suggestions and observations made by the Board have been incorporated in the letter of offer, to the Board after issuance of observations by the Board or after expiry of the period stipulated in sub-regulation (4) of regulation 71 if the Board has not issued observations."
    },
    {
      "title": "**Underwriting Agreement Details Missing**",
      "full_query": "**Underwriting Agreement Details Missing**\nOn page [1], it has been observed that Eco Fuel Systems (India) Limited has not disclosed the underwriting agreement with merchant bankers or stock brokers registered with the Board, indicating the number of specified securities they shall subscribe to on account of rejection of applications. This is a mandatory disclosure requirement for issuers undertaking an initial public offer not through the book building process, where underwriting is sought to cover under-subscription.\n\nRecommendation: Kindly furnish the underwriting agreement with merchant bankers or stock brokers, detailing the number of specified securities to be subscribed to on account of rejection of applications.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\n[Severity]: Page [1]",
      "page": "1",
      "severity": "Critical",
      "regulation": "SEBI (ICDR) Regulations, 2018",
      "status": "MISSING",
      "obligation": "If the issuer making an initial public offer, other than through the book building process, desires to have the issue underwritten to cover under-subscription in the issue, it shall, prior to the"
    },
    {
      "title": "**Website Disclosure of Financial Information**",
      "full_query": "**Website Disclosure of Financial Information**\nOn page 1, \"...vehicles and conducting tests at certified facilities, primarily ICAT, following the implementation of BS VI emission norms. In the past, the Company has independently undertaken activities involving the purchase of second-hand vehicles, which were subsequently submitted for testing at ICAT in line with BS VI requirements. Expenses Date of Cost of the Regulatory Vehicles Purchased incurred for Total purchase vehicle Expenses testing (Approx) Kia Seltos Phase-I (BS VI) 02/06/2023 11.40 2.00 12.6...\" However, the following information is missing: Confirmation that details specified in sub-regulation (1) of Regulation 14 of SEBI (ICDR) Regulations, 2018, including financial information such as the figures ₹8,102.62 Lakhs, ₹7,572.38 Lakhs, and ₹4,702.39 Lakhs, are placed on the websites of the stock exchange(s). Additionally, there is an AMOUNT_CONFLICT on pages 1 and 5 regarding financial figures, which requires clarification.\n\nRecommendation: Kindly confirm that all specified details are placed on the stock exchange websites and provide clarification for the AMOUNT_CONFLICT on pages 1 and 5.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\n[Severity]: Page 1\n\n**Financial Ratio Computation**\nOn page 3, it has been observed that Eco Fuel Systems (India) Limited has not disclosed the computation of financial ratios for both the upper and lower ends of the price band.\n\nRecommendation: Kindly provide the computation of financial ratios for both the upper and lower ends of the price band.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\n[Severity]: Page 3\n\n**Investor Attention to Basis of Issue Price**\nOn page 6, the DRHP mentions the basis of issue price. Kindly clarify that investors are being drawn to the 'basis of issue price' section, as required by the regulations.\n\nRecommendation: Kindly explicitly state in the DRHP that investors are drawn to the 'basis of issue price' section.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\n[Severity]: Page 6",
      "page": "1",
      "severity": "Major",
      "regulation": "SEBI (ICDR) Regulations, 2018",
      "status": "INSUFFICIENT",
      "obligation": "Details specified in sub regulation (1) shall also be placed on the websites of the stock exchange(s)."
    },
    {
      "title": "The lead manager(s) shall ensure that the monies received in respect o",
      "full_query": "**Release of Issue Monies Compliance**\n\nOn page 1, \"...ments and may not have been subjected to an audit or review by our Statutory Auditor. The manner in which such operational performance indicators are calculated and presented, and the assumptions and estimates used in such calculation, may vary from that used by other companies in same business as of our Company in India and other jurisdictions. Investors are accordingly cautioned against placing undue reliance on such information in making an investment decision and should consult their advisor...\" it has been observed that Eco Fuel Systems (India) Limited has not disclosed the lead manager's role in ensuring compliance with sub-section (3) of section 40 of the Companies Act, 2013, for the release of issue monies. This is a mandatory disclosure requirement. Furthermore, there is an AMOUNT_CONFLICT on pages 1 and 5, which needs to be addressed.\n\nRecommendation: Kindly provide details regarding the lead manager's responsibility and confirmation of compliance with Section 40(3) of the Companies Act, 2013, for the release of issue monies. Kindly also resolve the AMOUNT_CONFLICT identified.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\n[Severity]: Page 1\n\nCRITICAL",
      "page": "1",
      "severity": "Major",
      "regulation": "SEBI (ICDR) Regulations, 2018",
      "status": "MISSING",
      "obligation": "The lead manager(s) shall ensure that the monies received in respect of the rights issue are released to the issuer in compliance with the provisions of sub-section (3) of section 40 of the Companies Act, 2013, as applicable."
    },
    {
      "title": "Specified securities referred to in clauses (a) and (c) of sub-regulat",
      "full_query": "**Promoters' Contribution - Scheme Approval Details**\n\nOn page [1], the DRHP discusses the Company's activities involving the purchase of second-hand vehicles for testing at certified facilities, primarily ICAT, in line with BS VI emission norms. However, the following information is missing: Details of any scheme approved by a tribunal or the Central Government under sections 230 to 234 of the Companies Act, 2013, and how specified securities were acquired pursuant to such a scheme for the computation of promoters' contribution. This is a mandatory disclosure for the computation of promoters' contribution as per the regulations.\n\nRecommendation: Kindly provide the details of any scheme approved by a tribunal or the Central Government under sections 230 to 234 of the Companies Act, 2013, and the manner in which specified securities were acquired pursuant to such a scheme for the computation of promoters' contribution.\n\nRegulation Ref: Regulation 2(1)(oo), 31\n\n[Severity]: Page [1] - CRITICAL",
      "page": "1",
      "severity": "Critical",
      "regulation": "Regulation 2(1)(oo), 31",
      "status": "MISSING",
      "obligation": "Specified securities referred to in clauses (a) and (c) of sub-regulation (1) shall be eligible for the computation of promoters’ contribution if such securities are acquired pursuant to a scheme which has been approved by a tribunal or the Central Government under sections 230 to 234 of the Companies Act, 2013."
    },
    {
      "title": "[Dematerialisation Agreement Disclosure]",
      "full_query": "[Dematerialisation Agreement Disclosure]\nOn page [1], it has been observed that Eco Fuel Systems (India) Limited has not disclosed an agreement with a depository for dematerialisation of specified securities. This is a mandatory requirement for issuers making an initial public offer.\n\nRecommendation: Kindly provide a copy of the agreement with a depository for dematerialisation of specified securities.\n\nRegulation Ref: Regulation 31, Schedule VIII\n\n[Severity]: Page [1]",
      "page": "1",
      "severity": "Major",
      "regulation": "Regulation 31, Schedule VIII",
      "status": "MISSING",
      "obligation": "Unless otherwise provided in this Chapter, an issuer making an initial public offer of specified securities shall satisfy the conditions of this Chapter as on the date of filing of the draft offer document with the Board and also as on the date of filing the offer document with the Registrar of Companies."
    },
    {
      "title": "[Underwriting Extent - Promoter Exclusion]",
      "full_query": "[Underwriting Extent - Promoter Exclusion]\nOn page [1], \"Unless the context otherwise requires, in relation to business operations, in this chapter of this Prospectus, all references to “We”, “Us”, “Our” and “Our Company” are to Eco Fuel Systems (India) Limited as the case may be. OVERVIEW We are an alternative fuel systems ...\". It has been observed that Eco Fuel Systems (India) Limited has not disclosed the extent to which the issue can be underwritten, specifically excluding the entitlement of promoters and the promoter group.\n\nRecommendation: Kindly provide details on the underwriting extent, clearly delineating the portion attributable to shareholders other than the promoters and promoter group.\n\nRegulation Ref: Regulation 2(1)(oo), 31\n\n[Severity]: Page [1]",
      "page": "1",
      "severity": "Critical",
      "regulation": "Regulation 2(1)(oo), 31",
      "status": "MISSING",
      "obligation": "the issue can be underwritten only to the extent of entitlement of shareholders other than the promoters and promoter group."
    },
    {
      "title": "[Basis of Allotment Finalization]",
      "full_query": "[Basis of Allotment Finalization]\nOn page 1, it has been observed that Eco Fuel Systems (India) Limited has not disclosed the basis of allotment procedure, confirmation of fair and proper finalization, or details of verification by stock exchange employees, lead managers, and registrars. This is a mandatory disclosure required to ensure the integrity of the allotment process. Furthermore, there is an AMOUNT_CONFLICT on pages 1 and 5, which needs to be reconciled before the basis of allotment can be finalized.\n\nRecommendation: Kindly provide the complete basis of allotment procedure, confirmation of its fair and proper finalization, and details of the verification process by the authorized employees of the designated stock exchange, lead manager(s), and registrars to the issue. Kindly also resolve the AMOUNT_CONFLICT on pages 1 and 5.\n\nRegulation Ref: Regulation 55-57\n\n[Severity]: Critical Page 1",
      "page": "1",
      "severity": "Major",
      "regulation": "Regulation 55-57",
      "status": "MISSING",
      "obligation": "The authorised employees of the designated stock exchange, along with the lead manager(s) and registrars to the issue, shall ensure that the basis of allotment is finalised in a fair and proper manner in accordance with the procedure as specified in Part A of Schedule XIV."
    },
    {
      "title": "**Lead Manager's Due Diligence on Promoter/Director/Selling Shareholder Obligations**",
      "full_query": "**Lead Manager's Due Diligence on Promoter/Director/Selling Shareholder Obligations**\nOn page 1, \"...istributor of Landi Renzo SpA in India, our partnership has been instrumental in our growth since 2012. Landi Renzo SpA acquired Lovato Gas SpA, which was originally established in 1958 by Ottorino Lovato and became a leader in the alternative fuel kits industry by introducing the first multivalve for LPG systems. Following this acquisition, the sole distribution agreement was transferred to Landi Renzo SpA. Indian Alternative Fuel Vehicle Market is expected to grow at a CAGR of 12.5% throughout...\". However, the following information is missing: details of the lead manager's actions to ensure the issuer, promoters, directors, and selling shareholders have fulfilled their obligations as disclosed in the draft offer document and as required by the regulations. This is a critical omission as it pertains to the fulfillment of mandatory obligations. Furthermore, there is an AMOUNT_CONFLICT on pages 1 and 5, indicating a potential inconsistency in financial disclosures that requires immediate attention.\n\nRecommendation: Kindly provide a detailed explanation of the due diligence undertaken by the lead manager(s) to verify the fulfillment of all disclosed obligations by Eco Fuel Systems (India) Limited, its promoters, directors, and selling shareholders. Kindly also address and rectify the AMOUNT_CONFLICT identified on pages 1 and 5.\n\nRegulation Ref: Regulation 31, Schedule VIII\n\nCRITICAL: Page 1",
      "page": "1",
      "severity": "Critical",
      "regulation": "Regulation 31, Schedule VIII",
      "status": "MISSING",
      "obligation": "The lead manager(s) shall call upon the issuer, its promoters and its directors or in case of an offer for sale, also the selling shareholders, to fulfil their obligations as disclosed by them in the draft offer document and the offer document and as required in terms of these regulations."
    },
    {
      "title": "Copy of the offer documents shall also be filed with the Board and the",
      "full_query": "**Filing of Offer Documents with SEBI and Stock Exchanges**\n\nOn page 1, \"...se across diverse industries including alternate fuels, construction, instrumentation, automation, and electric vehicles. Virendra Maneklal Vora, our Managing Director, brings over two decades of industry experience and provides strategic vision and leadership to the Company, holds a Bachelor of Commerce degree from the University of Mumbai . His extensive background spans multiple sectors, and his contributions have driven growth, innovation, and market leadership throughout his 20-year tenure ...\". It has been observed that Eco Fuel Systems (India) Limited has not disclosed the confirmation of filing of offer documents with SEBI and the stock exchanges, nor has it detailed the role of the lead manager(s) in this filing process. Furthermore, there is no confirmation of prompt filing post-submission with the Registrar of Companies.\n\nRecommendation: Kindly provide confirmation of the filing of offer documents with SEBI and the relevant stock exchanges, along with details of the lead manager's role in this process and confirmation of prompt filing after submission to the Registrar of Companies.\n\nRegulation Ref: Regulation 31, Schedule VIII\n\nCRITICAL: Page 1",
      "page": "1",
      "severity": "Major",
      "regulation": "Regulation 31, Schedule VIII",
      "status": "MISSING",
      "obligation": "Copy of the offer documents shall also be filed with the Board and the stock exchange(s) through the lead manager(s) promptly after filing the offer documents with Registrar of Companies."
    },
    {
      "title": "**Allocation in Net Offer Category - Other Investors**",
      "full_query": "**Allocation in Net Offer Category - Other Investors**\nOn page 1, it has been observed that Eco Fuel Systems (India) Limited has not disclosed the allocation in the net offer category for issues made other than through the book building process, specifically regarding corporate bodies or institutions, irrespective of the number of specified securities applied for. This is a mandatory disclosure requirement under SEBI (ICDR) Regulations, 2018.\n\nRecommendation: Kindly provide the detailed allocation plan for the net offer category, specifying the proportion or number of securities to be allocated to corporate bodies and institutions, as per the obligation.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\n[Severity]: Page 1\n\n**Cross-Page Amount Conflict**\nOn page 1, there is an amount of ₹8,102.62 Lakhs mentioned. However, on page 5, a different amount is presented, leading to an inconsistency. This discrepancy needs to be resolved to ensure clarity and accuracy in the financial disclosures.\n\nRecommendation: Kindly reconcile the conflicting amounts presented on pages 1 and 5 and provide a clear and consistent figure.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\n[Severity]: Page 1, Page 5",
      "page": "1",
      "severity": "Critical",
      "regulation": "SEBI (ICDR) Regulations, 2018",
      "status": "MISSING",
      "obligation": "In an issue made other than through the book building process, the allocation in the net offer category shall be remaining to other investors including corporate bodies or institutions, irrespective of the number of specified securities applied for."
    },
    {
      "title": "Basis of Allotment Finalization Process",
      "full_query": "Basis of Allotment Finalization Process\nOn page 1, \"The authorised employees of the designated stock exchange along with the lead manager(s) and registrars to the issue shall ensure that the basis of allotment is finalised in a fair and proper manner as may be prescribed by the Board.\" However, the following information is missing: details regarding the specific process and responsibilities for finalizing the basis of allotment, including the roles of the lead manager(s) and registrars to the issue in this process.\n\nRecommendation: Kindly provide a detailed explanation of the procedures and responsibilities involved in the finalization of the basis of allotment.\n\nRegulation Ref: Regulation 31, Schedule VIII\n\n[Severity]: Page 1\n\nCRITICAL",
      "page": "1",
      "severity": "Major",
      "regulation": "Regulation 31, Schedule VIII",
      "status": "MISSING",
      "obligation": "The authorised employees of the designated stock exchange along with the lead manager(s) and registrars to the issue shall ensure that the basis of allotment is finalised in a fair and proper manner as may be prescribed by the Board."
    },
    {
      "title": "The abridged letter of offer, along with application form, shall be de",
      "full_query": "**Despatch of Abridged Letter of Offer and Application Form**\n\nOn page [1], it has been observed that Eco Fuel Systems (India) Limited has not disclosed details regarding the despatch of the abridged letter of offer and application form to all existing shareholders. This disclosure should include the method of despatch (registered post, speed post, courier service, or electronic transmission) and confirmation that such despatch occurred at least three days before the date of opening of the issue.\n\nRecommendation: Kindly provide the complete details regarding the despatch of the abridged letter of offer and application form to all existing shareholders, including the method of despatch and confirmation of the timeline as per the regulations.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\nCRITICAL: Page [1]",
      "page": "1",
      "severity": "Major",
      "regulation": "SEBI (ICDR) Regulations, 2018",
      "status": "MISSING",
      "obligation": "The abridged letter of offer, along with application form, shall be despatched through registered post or speed post or by courier service or by electronic transmission to all the existing shareholders at least three days before the date of opening of the issue."
    },
    {
      "title": "**Plain Paper Application - Renunciation Rights**",
      "full_query": "**Plain Paper Application - Renunciation Rights**\nOn page [1], it has been observed that Eco Fuel Systems (India) Limited has not disclosed the obligation that shareholders making an application on plain paper shall not be entitled to renounce their rights and shall not utilise the application form for any purpose including renunciation even if it is received subsequently. This is a mandatory disclosure requirement under the SEBI (ICDR) Regulations, 2018.\n\nRecommendation: Kindly incorporate the complete disclosure regarding the rights and restrictions for shareholders applying on plain paper, specifically concerning the non-renunciation of rights.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\n[Severity]: Page [1]",
      "page": "1",
      "severity": "Critical",
      "regulation": "SEBI (ICDR) Regulations, 2018",
      "status": "MISSING",
      "obligation": "Shareholders making an application on plain paper shall not be entitled to renounce their rights and shall not utilise the application form for any purpose including re nunciation even if it is received subsequently."
    },
    {
      "title": "[Filing of Letter of Offer with SEBI and Stock Exchanges]",
      "full_query": "[Filing of Letter of Offer with SEBI and Stock Exchanges]\nOn page 1, it has been observed that Eco Fuel Systems (India) Limited has not disclosed the copy of the letter of offer filed with the Board and the stock exchanges through the lead manager simultaneously with filing of the letter of offer with the designated stock exchange, including the dates of filing and reference numbers.\n\nRecommendation: Kindly provide a confirmation of the filing of the letter of offer with SEBI and stock exchanges through the lead manager, including the dates of filing and relevant reference numbers.\n\nRegulation Ref: Regulation 31, Schedule VIII\n\nCRITICAL: Page 1",
      "page": "1",
      "severity": "Major",
      "regulation": "Regulation 31, Schedule VIII",
      "status": "MISSING",
      "obligation": "Copy of the letter of offer shall also be filed with the Board and the stock exchanges through the lead manager simultaneously with filing of the letter of offer with the designated stock exchange."
    },
    {
      "title": "[Aggregate Value of Rights Issue and Compliance Status]",
      "full_query": "[Aggregate Value of Rights Issue and Compliance Status]\nOn page 1, it has been observed that Eco Fuel Systems (India) Limited has not disclosed the aggregate value of the rights issue and confirmation of compliance with Chapter conditions for rights issues of 50 crore rupees or more. The obligation requires issuers offering specified securities of an aggregate value of fifty crores rupees or more through a rights issue to satisfy the conditions of Chapter at the time of filing the draft letter of offer.\n\nRecommendation: Kindly provide the aggregate value of the rights issue and a clear confirmation of compliance with the conditions stipulated in Chapter for rights issues of fifty crores rupees or more.\n\nRegulation Ref: Regulation 31, Schedule VIII\n\n[CRITICAL]: Page 1",
      "page": "1",
      "severity": "Major",
      "regulation": "Regulation 31, Schedule VIII",
      "status": "MISSING",
      "obligation": "an issuer offering specified securities of aggregate value of 88[fifty crores] rupees or more, through a rights issue shall satisfy the conditions of this Chapter at the time of filing the draft letter of offer with the Board and also at the time of filing the final letter of offer with the stock exchanges, as the case may be."
    },
    {
      "title": "**Interest Undertaking for Unallotted Securities/Refunds**",
      "full_query": "**Interest Undertaking for Unallotted Securities/Refunds**\nOn page 1, \"...al Statements included in this Draft Red Herring Prospectus. For further details, see “Restated Financial Information” on page 189. We have, in this Draft Red Herring Prospectus, included various operational performance indicators, some of which may not be derived from our Restated Consolidated Financial Statements and may not have been subjected to an audit or review by our Statutory Auditor. The manner in which such operational performance indicators are calculated and presented, and the assum...\". It has been observed that Eco Fuel Systems (India) Limited has not disclosed the undertaking to pay interest at the rate of fifteen per cent. per annum to the shareholders within such time as disclosed in the draft letter of offer and the letter of offer, and confirmation of lead manager(s) ensuring the same, as required by SEBI (ICDR) Regulations, 2018. Furthermore, there is an AMOUNT_CONFLICT on pages [1, 5] which needs to be addressed.\n\nRecommendation: Kindly provide the specific undertaking to pay interest at the rate of fifteen per cent. per annum to the shareholders within the stipulated time, along with confirmation from the lead manager(s) regarding their role in ensuring this compliance. Kindly also resolve the AMOUNT_CONFLICT identified on pages [1, 5].\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\nCRITICAL: Page 1",
      "page": "1",
      "severity": "Major",
      "regulation": "SEBI (ICDR) Regulations, 2018",
      "status": "MISSING",
      "obligation": "Where the specified securities are not allotted and/or application monies are not refunded or unblocked within the period stipulated in sub-regulation (1) above, the issuer shall undertake to pay interest at the rate of fifteen per cent. per annum to the shareholders within such time as disclosed in the draft letter of offer and the letter of offer and the lead manager(s) shall ensure the same."
    },
    {
      "title": "an updated pre-filed offer document or a fresh draft offer document un",
      "full_query": "**Filing of Updated/Fresh Draft Offer Document and Fees**\n\nOn page 1, it has been observed that Eco Fuel Systems (India) Limited has not disclosed confirmation of filing an updated pre-filed offer document or a fresh draft offer document under Chapter II, or a fresh pre-filed draft offer document, as the case may be, along with the fees specified in Schedule III. Additionally, there is an AMOUNT_CONFLICT on pages 1 and 5.\n\nRecommendation: Kindly provide confirmation of the filing of the updated/fresh draft offer document with the Board, along with details of the fees paid as per Schedule III. Kindly also address the AMOUNT_CONFLICT identified on pages 1 and 5.\n\nRegulation Ref: Regulation 31, Schedule VIII\n\n[Severity]: Critical Page 1",
      "page": "1",
      "severity": "Major",
      "regulation": "Regulation 31, Schedule VIII",
      "status": "MISSING",
      "obligation": "an updated pre-filed offer document or a fresh draft offer document under Chapter II or fresh pre-filed draft offer document, as the case may be, shall be filed with the Board along with fees specified in Schedule III"
    },
    {
      "title": "**Issue Opening Date Disclosure**",
      "full_query": "**Issue Opening Date Disclosure**\nOn page [1], it has been observed that Eco Fuel Systems (India) Limited has not disclosed the Date of filing of Red Herring Prospectus with Registrar of Companies and the Date of opening of the issue. This is a mandatory disclosure requirement to ensure compliance with the stipulated waiting period before the issue opens.\n\nRecommendation: Kindly provide the Date of filing of the Red Herring Prospectus with the Registrar of Companies and the Date of opening of the issue.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\nCRITICAL: Page [1]",
      "page": "1",
      "severity": "Major",
      "regulation": "SEBI (ICDR) Regulations, 2018",
      "status": "MISSING",
      "obligation": "An issue shall be opened after at least three working days from the date of filing, the red herring prospectus , in case of a book built issue and the prospectus, in case of a fixed price issue, with the Registrar of Companies."
    },
    {
      "title": "In case the promoters have to subscribe to equity shares or convertibl",
      "full_query": "**Promoters' Contribution and Escrow Account Details**\n\nOn page [1], \"...in this Draft Red Herring Prospectus. Unless the context otherwise requires, in relation to business operations, in this chapter of this Prospectus, all references to “We”, “Us”, “Our” and “Our Company” are to Eco Fuel Systems (India) Limited as the case may be. OVERVIEW We are an alternative fuel systems company based in India offering trading, distribution, retrofitment, kit integration, and testing solutions for LPG, CNG, and LNG conversion kits, catering to three-wheelers, four-wheelers, an...\" it has been observed that Eco Fuel Systems (India) Limited has not disclosed details regarding the promoters' contribution to the minimum promoters' contribution, confirmation of an escrow account for such contribution, the scheduled commercial bank where the escrow account is maintained, and the specific release conditions for the escrow account. This information is crucial for compliance with the minimum promoters' contribution requirements.\n\nRecommendation: Kindly provide full details of the promoters' contribution towards the minimum promoters' contribution, including confirmation of the escrow account, the name of the scheduled commercial bank maintaining the escrow account, and the conditions for its release.\n\nRegulation Ref: Regulation 2(1)(oo), 31\n\n[Severity]: Page [1]",
      "page": "1",
      "severity": "Critical",
      "regulation": "Regulation 2(1)(oo), 31",
      "status": "MISSING",
      "obligation": "In case the promoters have to subscribe to equity shares or convertible securities towards minimum promoters’ contribution, the amount of promoters’ contribution shall be kept in an escrow account with a scheduled commercial bank, which shall be released to the issuer along with the release of the issue proceeds."
    },
    {
      "title": "“pre-filed draft offer document” shall mean draft offer document filed",
      "full_query": "**Inconsistent Financial Figures and Lack of Comprehensive Disclosure**\n\nOn page 1, \"... the context of the Restated Consolidated Financial Statements and other information relating to our business and operations included in this Draft Red Herring Prospectus. Unless the context otherwise requires, in relation to business operations, in this chapter of this Prospectus, all references to “We”, “Us”, “Our” and “Our Company” are to Eco Fuel Systems (India) Limited as the case may be. OVERVIEW We are an alternative fuel systems company based in India offering trading, distribution, retr...\" However, the following information is missing: The DRHP presents limited financial figures (₹8,102.62 Lakhs, ₹7,572.38 Lakhs, ₹4,702.39 Lakhs) without providing comprehensive financial data or context for these amounts. Furthermore, there is an identified AMOUNT_CONFLICT on pages 1 and 5, indicating potential inconsistencies in financial reporting. The DRHP also lacks specific details on how it enables informed investment decisions beyond risk factors, the sustainability of the business model, and a comprehensive analysis of the competitive landscape.\n\nRecommendation: Kindly provide comprehensive financial statements and detailed explanations for all figures presented. Kindly reconcile the AMOUNT_CONFLICT identified on pages 1 and 5 and provide a clear explanation. Kindly elaborate on how the DRHP facilitates informed investment decisions, including a detailed analysis of the business model's sustainability and the competitive landscape.\n\nRegulation Ref: Regulation 31, Schedule VIII\n\n[Severity]: Page 1\n\n**Incomplete Disclosure of Material Information**\n\nOn page 9, it has been observed that Eco Fuel Systems (India) Limited has not disclosed confirmation of all material disclosures being true and adequate. While the DRHP provides an overview of the company's business, it lacks explicit confirmation from the company regarding the veracity and completeness of all material information presented, which is crucial for investors to make informed decisions.\n\nRecommendation: Kindly provide a clear and explicit confirmation that all material disclosures within the Draft Red Herring Prospectus are true, accurate, and adequate.\n\nRegulation Ref: Regulation 31, Schedule VIII\n\n[Severity]: Page 9\n\n**Lack of Clarity on Business Model Sustainability and Competitive Landscape**\n\nOn page 10, the DRHP mentions \"We are an alternative fuel systems company based in India offering trading, distribution, retr...\". Kindly clarify the specific details of the company's business model, including its revenue streams, operational strategies, and long-term sustainability. Kindly provide a comprehensive analysis of the competitive landscape in which Eco Fuel Systems (India) Limited operates, including key competitors, market share, and the company's competitive advantages.\n\nRecommendation: Kindly provide detailed information on the business model's sustainability and a thorough analysis of the competitive landscape.\n\nRegulation Ref: Regulation 31, Schedule VIII\n\n[Severity]: Page 10",
      "page": "1",
      "severity": "Major",
      "regulation": "Regulation 31, Schedule VIII",
      "status": "INSUFFICIENT",
      "obligation": "“pre-filed draft offer document” shall mean draft offer document filed with the Board under this Chapter"
    },
    {
      "title": "[Updated Draft Red Herring Prospectus Filing Obligation]",
      "full_query": "[Updated Draft Red Herring Prospectus Filing Obligation]\nOn page 1, it has been observed that Eco Fuel Systems (India) Limited has not disclosed the obligation to file updated draft red herring prospectuses within sixteen months from the date of issuance of observations by the Board as per regulation 59 C. This information is crucial for investors to understand the timeline and process for subsequent filings.\n\nRecommendation: Kindly provide details regarding the filing of updated draft red herring prospectuses within sixteen months from the date of issuance of observations by the Board as per regulation 59 C.\n\nRegulation Ref: Regulation 31, Schedule VIII\n\n[Severity]: Critical Page 1",
      "page": "1",
      "severity": "Major",
      "regulation": "Regulation 31, Schedule VIII",
      "status": "MISSING",
      "obligation": "the issuer shall file updated draft red herring prospectus -I with the Board and the stock exchanges in terms of regulation 59 C of these regulations within sixteen months from the date of issuance of the observations by the Board"
    },
    {
      "title": "The lead manager(s) shall ensure availability of the letter of offer a",
      "full_query": "**Availability of Issue Material**\n\nOn page [1], \"...tribution, retrofitment, kit integration, and testing solutions for LPG, CNG, and LNG conversion kits, catering to three-wheelers, four-wheelers, and heavy-duty vehicles. Our product portfolio encompasses complete alternative fuel system components including High Pressure Reducers (NGB-L and RMJ models), Electronic Control Units with OBD II compatibility for 4-cylinder and 8-cylinder engines, ECU Wiring Harnesses (Smart-II and C-OBDII-8 Cyl), Gas Injectors, Switches with Level Indicators, Refil...\" it has been observed that Eco Fuel Systems (India) Limited has not disclosed confirmation of the availability of the letter of offer, application forms, and other issue material with stock exchanges, registrar to issue, registrar and share transfer agents, depository participants, stock brokers, underwriters, bankers to the issue, investors‘ associations, and self certified syndicate banks before the opening of the issue. This is a mandatory requirement to ensure all stakeholders have access to necessary documentation prior to the issue opening.\n\nRecommendation: Kindly provide confirmation of the availability of the letter of offer, application forms, and other issue material with all stipulated entities before the opening of the issue.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\nCRITICAL: Page [1]",
      "page": "1",
      "severity": "Critical",
      "regulation": "SEBI (ICDR) Regulations, 2018",
      "status": "MISSING",
      "obligation": "The lead manager(s) shall ensure availability of the letter of offer and other issue material including a pplication forms with stock exchanges, registrar to issue, registrar and share transfer agents, depository participants, stock brokers, underwriters, bankers to the issue, investors‘ associations and self certified syndicate banks before the opening of the issue."
    },
    {
      "title": "The rights entitlements shall be credited to the demat account of the ",
      "full_query": "**Rights Entitlements Credit Confirmation**\n\nOn page [1], it has been observed that Eco Fuel Systems (India) Limited has not disclosed confirmation of the credit of rights entitlements to the demat accounts of shareholders before the date of opening of the issue. This is a mandatory disclosure requirement to ensure that shareholders are in possession of their entitlements prior to the issue opening, enabling them to exercise their rights effectively.\n\nRecommendation: Kindly provide a clear confirmation, supported by documentary evidence if necessary, that the rights entitlements have been credited to the demat accounts of all eligible shareholders prior to the opening date of the issue.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\n[Critical]: Page [1]",
      "page": "1",
      "severity": "Major",
      "regulation": "SEBI (ICDR) Regulations, 2018",
      "status": "MISSING",
      "obligation": "The rights entitlements shall be credited to the demat account of the shareholders before the date of opening of the issue."
    },
    {
      "title": "The rights issue shall be kept open for subscription for a maximum per",
      "full_query": "**Rights Issue Subscription Period**\n\nOn page [1], it has been observed that Eco Fuel Systems (India) Limited has not disclosed the duration for which the rights issue will remain open for subscription. The SEBI (ICDR) Regulations, 2018, mandate that the rights issue shall be kept open for subscription for a maximum period of thirty days.\n\nRecommendation: Kindly disclose the exact period for which the rights issue will remain open for subscription.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\n[Severity]: Critical Page [1]",
      "page": "1",
      "severity": "Major",
      "regulation": "SEBI (ICDR) Regulations, 2018",
      "status": "MISSING",
      "obligation": "The rights issue shall be kept open for subscription for a maximum period of thirty days"
    },
    {
      "title": "**Release of Issue Proceeds to Issuer**",
      "full_query": "**Release of Issue Proceeds to Issuer**\nOn page 1, it has been observed that Eco Fuel Systems (India) Limited has not disclosed details regarding the process for releasing issue proceeds to the issuer, including timelines and conditions for release as per Section 40(3) of the Companies Act, 2013. This is a mandatory disclosure requirement under Section 40(3) of the Companies Act, 2013, and the SEBI (ICDR) Regulations, 2018. Furthermore, there is an AMOUNT_CONFLICT on pages [1, 5] which needs to be reconciled before the release of proceeds can be confirmed.\n\nRecommendation: Kindly provide a detailed disclosure outlining the complete process for the release of issue proceeds to the issuer, including specific timelines and the conditions precedent for such release, in compliance with Section 40(3) of the Companies Act, 2013. Kindly also address and resolve the AMOUNT_CONFLICT identified on pages [1, 5].\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\nCRITICAL: Page 1",
      "page": "1",
      "severity": "Major",
      "regulation": "SEBI (ICDR) Regulations, 2018",
      "status": "MISSING",
      "obligation": "The lead manager(s) shall ensure that the monies received in respect of the issue are released to the issuer in compliance with the provisions of Section 40 (3) of the Companies Act, 2013, as applicable."
    },
    {
      "title": "[Lock-in Provisions for Employee Shares]",
      "full_query": "[Lock-in Provisions for Employee Shares]\nOn page 1, \"We have, in this Draft Red Herring Prospectus, included various operational performance indicators, some of which may not be derived from our Restated Consolidated Financial Statements and may not have been subjected to an audit or review by our Statutory Auditor. The manner in which such operational performance indicators are calculated and presented, and the assumptions and estimates used in such calculation, may vary from that used by other companies...\" However, the following information is missing: Details on lock-in provisions for equity shares allotted to employees as per SEBI (Share Based Employee Benefits and Sweat Equity) Regulations, 2021. There is also an amount conflict on pages 1 and 5, with figures ₹8,102.62 Lakhs, ₹7,572.38 Lakhs, and ₹4,702.39 Lakhs being presented without clear reconciliation.\n\nRecommendation: Kindly provide the complete details regarding the lock-in provisions for equity shares allotted to employees in compliance with Regulation 31 and Schedule VIII of the SEBI (Share Based Employee Benefits and Sweat Equity) Regulations, 2021. Kindly also reconcile the conflicting financial figures presented on pages 1 and 5.\n\nRegulation Ref: Regulation 31, Schedule VIII\n\nCRITICAL: Page 1",
      "page": "1",
      "severity": "Major",
      "regulation": "Regulation 31, Schedule VIII",
      "status": "MISSING",
      "obligation": "the equity shares allotted to the employees shall be subject to the provisions of lock-in as specified under the Securities and Exchange Board of India (Share Based Employee Benefits and Sweat Equity) Regulations, 2021."
    },
    {
      "title": "**Material Disclosures - Adequacy for Informed Investment Decision**",
      "full_query": "**Material Disclosures - Adequacy for Informed Investment Decision**\nOn page 1, \"... respectively, growing at a CAGR of 31.26% between Financial Years 2023 and 2025. Our Company is the exclusive distributor of alternative fuel kits under the LOVATO brand name in India. We import our alternative fuel kits from Landi Renzo SpA, a globally recognized company based in Italy, which manufactures and sells alternative fuel kits under the LOVATO brand. Since the commencement of our operations, we have maintained a partnership with Landi Renzo SpA through a long-term sole distribution a...\" However, the following information is missing: An explicit statement confirming that all material disclosures within the draft letter of offer and letter of offer are true and adequate to enable applicants to take an informed investment decision. Additionally, full disclosures of the terms of conversion or exchange are not provided. There is also an AMOUNT_CONFLICT on pages 1 and 5.\n\nRecommendation: Kindly provide an explicit statement confirming the truthfulness and adequacy of all material disclosures for informed investment decisions and furnish full disclosures of the terms of conversion or exchange.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\n[Severity]: Page 1, Page 5\n\nCRITICAL",
      "page": "1",
      "severity": "Major",
      "regulation": "SEBI (ICDR) Regulations, 2018",
      "status": "INSUFFICIENT",
      "obligation": "The draft letter of offer and letter of offer shall contain all material disclosures which are true and adequate to enable the applicants to take an informed investment decision."
    },
    {
      "title": "**Appointment of Syndicate Members/Bankers to Issue**",
      "full_query": "**Appointment of Syndicate Members/Bankers to Issue**\nOn page 1, \"...ive industry knowledge and expertise of our senior management, who collectively possess hands- on experience of more than three decades. Their rich experience has played a pivotal role in shaping and executing our business strategies and operational processes. By leveraging the market acumen of our promoters and senior management, we adeptly identify market opportunities and tailor products and services to cater to specific customer segments. This collective wealth of market experience has signi...\" it has been observed that Eco Fuel Systems (India) Limited has not disclosed the appointment of syndicate member(s) for the book building process or bankers to issue for other issues, as specified in Schedule XII of the SEBI (ICDR) Regulations, 2018. This is a mandatory disclosure for issues made through the book building process or other issue methods.\n\nRecommendation: Kindly disclose the appointment of syndicate member(s) or bankers to issue, along with the relevant details as per Schedule XII.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\n[Severity]: Page 1\n\n**Note:** While the provided DRHP extract discusses management experience, it does not contain any information related to the appointment of syndicate members or bankers to the issue, which is the subject of the compliance obligation. The cross-page issue regarding AMOUNT_CONFLICT on pages [1, 5] is noted but not directly addressed in this specific query as it pertains to financial figures, not the appointment of intermediaries.",
      "page": "1",
      "severity": "Critical",
      "regulation": "SEBI (ICDR) Regulations, 2018",
      "status": "MISSING",
      "obligation": "The issuer shall, in case of an issue made through the book building process, appoint syndicate member(s) and in the case of any other issue, appoint bankers to issue, at centres in the manner specified in Schedule XII."
    },
    {
      "title": "The issuer shall announce a record date for the purpose of determining",
      "full_query": "**Record Date Disclosure for Rights Issue**\n\nOn page 1, it has been observed that Eco Fuel Systems (India) Limited has not disclosed the announcement of a record date for the purpose of determining the shareholders eligible to apply for specified securities in the proposed rights issue. This is a mandatory disclosure requirement for rights issues.\n\nRecommendation: Kindly announce the record date for determining shareholders eligible to apply for specified securities in the proposed rights issue.\n\nRegulation Ref: Regulation 31, Schedule VIII\n\nCRITICAL: Page 1",
      "page": "1",
      "severity": "Major",
      "regulation": "Regulation 31, Schedule VIII",
      "status": "MISSING",
      "obligation": "The issuer shall announce a record date for the purpose of determining the shareholders eligible to apply for specified securities in the proposed rights issue for such period as may be specified in the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations, 2015."
    },
    {
      "title": "the lead manager(s) shall ensure the payment of interest at the rate o",
      "full_query": "**Interest Payment Obligation Disclosure**\n\nOn page 1, \"...market-report/indian-alternative- 130 ii) Project Execution After understanding the requirements of corporate customers, Eco fuel oversees the conversion of the fleet. This process includes: 1. Installation of Alternate fuel kits by our technical experts. 2. Regular training sessions for the client’s team on kit maintenance. 3. Resolution of technical issues post-installation. B. Government Customers Tender Process to Government Customers: Our company actively participates in tenders floated by...\" it has been observed that Eco Fuel Systems (India) Limited has not disclosed the rate of interest payable to shareholders, the timeframe for such payment, and confirmation of the lead manager's role in ensuring this obligation.\n\nRecommendation: Kindly disclose the rate of interest payable to shareholders, the timeframe for such payment, and confirm the lead manager's obligation to ensure timely payment as per the SEBI (ICDR) Regulations, 2018.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\n[Severity]: Page 1\n\n**Note:** While the provided DRHP excerpt does not contain the specific information requested, the compliance detail indicates a mandatory disclosure requirement. The cross-page issue regarding AMOUNT_CONFLICT on pages [1, 5] is noted but not directly relevant to this specific query.",
      "page": "1",
      "severity": "Major",
      "regulation": "SEBI (ICDR) Regulations, 2018",
      "status": "MISSING",
      "obligation": "the lead manager(s) shall ensure the payment of interest at the rate of fifteen per cent. per annum to the shareholders within such time as disclosed in the draft letter of offer and the letter of offer."
    },
    {
      "title": "**Charge/Security on Assets for Convertible Debt Instruments**",
      "full_query": "**Charge/Security on Assets for Convertible Debt Instruments**\nOn page 1, \"...rnative fuel kits under the LOVATO brand. Since the commencement of our operations, we have maintained a partnership with Landi Renzo SpA through a long-term sole distribution agreement that allows us to market and sell LPG, CNG, and LNG conversion kits in India. We also procure empty cylinders and other ancillary components from domestic and international suppliers. As the exclusive distributor of Landi Renzo SpA in India, our partnership has been instrumental in our growth since 2012. Landi Re...\" it has been observed that Eco Fuel Systems (India) Limited has not disclosed any information regarding the creation of a charge or security on its assets in respect of secured convertible debt instruments. Specifically, there is no disclosure on whether security is already created on such assets in favour of any existing lender or security trustee, or if the issue is proposed to be secured by the creation of security on a leasehold land. Consequently, the consent of such lender or security trustee or lessor for a second or pari passu charge has not been disclosed, nor has the calculation of security cover after the reduction of prior liabilities.\n\nRecommendation: Kindly provide details on any proposed charges or security for convertible debt instruments, including the consent of existing lenders/lessors for second/pari passu charges, and the calculation of security cover after the reduction of prior liabilities.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\n[Severity]: Page 1\n\nCRITICAL REQUIREMENTS:\n1. MUST start with \"On page [X], \" (use pages: [1, 3, 6])\n2. For INSUFFICIENT: Quote actual text then say \"However, the following information is missing: [list]\"\n3. For MISSING: \"it has been observed that Eco Fuel Systems (India) Limited has not disclosed [what's missing]\"\n4. For UNCLEAR: \"the DRHP mentions [quote]. Kindly clarify [what needs clarification]\"\n5. ALWAYS use \"Kindly\" before action verbs\n6. NEVER use: \"the document states\", \"as per the DRHP\" - just quote directly\n7. Tone: Professional, respectful, specific\n8. If cross-page inconsistencies exist, mention them\n\nSEVERITY:\n- MISSING + mandatory → Critical\n- MISSING + optional → Major\n- INSUFFICIENT → Major\n- UNCLEAR → Minor",
      "page": "1",
      "severity": "Major",
      "regulation": "SEBI (ICDR) Regulations, 2018",
      "status": "MISSING",
      "obligation": "if the issue proposes to create a charge or security on its assets in respect of secured convertible debt instruments, it shall ensure that where security is already created on such assets in favour of any existing lender or security trustee or the issue of convertible debt instruments is proposed to be secured by creation of security on a leasehold land, the consent of such lender or security trustee or lessor for a second or pari passu charge has been obtained and submitted to the debenture trustee before the opening of the issue"
    },
    {
      "title": "In an issue made other than through the book building process, the all",
      "full_query": "**Allocation Details for Net Offer Category**\n\nOn page [1], it has been observed that Eco Fuel Systems (India) Limited has not disclosed the allocation details for the net offer category for issues made other than through the book building process, specifically the distribution to individual applicants other than retail individual investors and other investors including corporate bodies or institutions. This information is crucial for understanding the complete offering structure.\n\nRecommendation: Kindly provide the detailed allocation breakdown for the net offer category, specifying the sub-categories of investors other than retail individual investors.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\n[Severity]: Page [1]",
      "page": "1",
      "severity": "Critical",
      "regulation": "SEBI (ICDR) Regulations, 2018",
      "status": "MISSING",
      "obligation": "In an issue made other than through the book building process, the allocation in the net offer category shall be remaining to individual applicants other than retail individual investors."
    },
    {
      "title": "**Promoter Details Disclosure**",
      "full_query": "**Promoter Details Disclosure**\nOn page [2], it has been observed that Eco Fuel Systems (India) Limited has not disclosed the Permanent Account Number of its promoters (individual and corporate), bank account number of its promoters (individual and corporate), passport number of its promoters (individual), company registration number or equivalent of its promoters (corporate), and the address of the Registrar of Companies with which the promoter is registered (corporate).\n\nRecommendation: Kindly provide the Permanent Account Number, bank account number, and passport number of its promoters where they are individuals, and the Permanent Account Number, bank account number, company registration number or equivalent, and the address of the Registrar of Companies with which the promoter is registered, where the promoter is a body corporate.\n\nRegulation Ref: Regulation 2(1)(oo), 31\n\nCRITICAL: Page [2]",
      "page": "2",
      "severity": "Critical",
      "regulation": "Regulation 2(1)(oo), 31",
      "status": "MISSING",
      "obligation": "The issuer shall also file the draft letter of offer with the stock exchange(s) and shall submit the Permanent Account Number, bank account number and passport number of its promoters where they are individuals, and Permanent Account Number, bank account number, company registration number or equivalent and the address of the Registrar of Companies with which the promoter is registered, where the promoter is a body corporate."
    },
    {
      "title": "The issuer shall also file the draft offer document with the stock exc",
      "full_query": "**Filing of Draft Offer Document and Promoter Information**\n\nOn page 2, it has been observed that Eco Fuel Systems (India) Limited has not disclosed the filing of the draft offer document with the stock exchanges where the specified securities are proposed to be listed. Furthermore, the Permanent Account Number, bank account number, and passport number of its promoters (if individuals), or the Permanent Account Number, bank account number, company registration number or equivalent, and the address of the Registrar of Companies (if the promoter is a body corporate) are also missing.\n\nRecommendation: Kindly ensure the draft offer document is filed with the relevant stock exchanges and provide the complete promoter information as stipulated.\n\nRegulation Ref: Regulation 2(1)(oo), 31\n\nCRITICAL: Page 2",
      "page": "2",
      "severity": "Critical",
      "regulation": "Regulation 2(1)(oo), 31",
      "status": "MISSING",
      "obligation": "The issuer shall also file the draft offer document with the stock exchange(s) where the specified securities are proposed to be listed, and submit the Permanent Account Number, bank account number and passport number of its promoters (if individuals), or Permanent Account Number, bank account number, company registration number or equivalent and the address of the Registrar of Companies (if promoter is a body corporate), to the stock exchange(s)."
    },
    {
      "title": "Allocation Details for Net Offer Category",
      "full_query": "Allocation Details for Net Offer Category\nOn page [2], it has been observed that Eco Fuel Systems (India) Limited has not disclosed the allocation details for Qualified Institutional Buyers (QIBs), Mutual Funds, and other categories within the net offer category. This information is crucial for ensuring compliance with the prescribed limits for QIB allocation, including the specific allocation to mutual funds.\n\nRecommendation: Kindly provide the detailed allocation breakdown for the net offer category, specifying the percentage allocated to QIBs (not exceeding fifty per cent), and within that, the percentage allocated to mutual funds (five per cent), as well as allocations to other categories.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\n[Severity]: Page [2]",
      "page": "2",
      "severity": "Critical",
      "regulation": "SEBI (ICDR) Regulations, 2018",
      "status": "MISSING",
      "obligation": "In an issue made through the book building process under sub-regulation (1) of regulation 6, the allocation in the net offer category shall be no t more than fifty per cent. to qualified institutional buyers, five per cent. of which shall be allocated to mutual funds."
    },
    {
      "title": "Appointment of Debenture Trustee",
      "full_query": "Appointment of Debenture Trustee\nOn page [2], it has been observed that Eco Fuel Systems (India) Limited has not disclosed the appointment of at least one debenture trustee in accordance with the provisions of the Companies Act, 2013 and the Securities and Exchange Board of India (Debenture Trustees) Regulations, 1993. This includes the name(s) of the appointed debenture trustee(s), their registration details with SEBI, and the date of their appointment.\n\nRecommendation: Kindly provide details of the appointed debenture trustee(s), including their name, SEBI registration number, and the date of appointment.\n\nRegulation Ref: Regulation 31, Schedule VIII\n\n[Severity]: CRITICAL Page [2]",
      "page": "2",
      "severity": "Major",
      "regulation": "Regulation 31, Schedule VIII",
      "status": "MISSING",
      "obligation": "it has appointed at least one debenture trustee in accordance with the provisions of the Companies Act, 2013 and the Securities and Exchange Board of India (Debenture Trustees) Regulations, 1993;"
    },
    {
      "title": "The letter of offer shall also be provided by the issuer or lead manag",
      "full_query": "**Letter of Offer to Existing Shareholders**\n\nOn page [3], it has been observed that Eco Fuel Systems (India) Limited has not disclosed the provision of the letter of offer to any existing shareholder who makes a request in this regard.\n\nRecommendation: Kindly ensure that the DRHP clearly states the issuer's or lead manager(s)' obligation to provide the letter of offer to any existing shareholder upon request, as mandated by the SEBI (ICDR) Regulations, 2018.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\n[Severity]: Page [3]",
      "page": "3",
      "severity": "Major",
      "regulation": "SEBI (ICDR) Regulations, 2018",
      "status": "MISSING",
      "obligation": "The letter of offer shall also be provided by the issuer or lead manager(s) to any existing shareholder who makes a request in this regard."
    },
    {
      "title": "[Allocation to QIBs and Mutual Funds in Net Offer Category]",
      "full_query": "[Allocation to QIBs and Mutual Funds in Net Offer Category]\nOn page [3], it has been observed that Eco Fuel Systems (India) Limited has not disclosed the allocation percentage to Qualified Institutional Buyers (QIBs) and Mutual Funds in the net offer category for the book-building process. The DRHP mentions figures such as 21.60%, 15.08%, and 7.87% in other contexts, but there is no clear disclosure regarding the mandatory allocation as per sub-regulation (2) of regulation 6.\n\nRecommendation: Kindly disclose the specific allocation percentages to Qualified Institutional Buyers (QIBs) and Mutual Funds in the net offer category, ensuring that the allocation to QIBs is not less than seventy-five per cent, with five per cent of which allocated to mutual funds.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\n[Severity]: CRITICAL Page [3]",
      "page": "3",
      "severity": "Critical",
      "regulation": "SEBI (ICDR) Regulations, 2018",
      "status": "MISSING",
      "obligation": "In an issue made through the book building process under sub-regulation (2) of regulation 6, the allocation in the net offer category shall be not less than seventy five per cent. to qualified institutional buyers, five per cent. of which shall be allocated to mutual funds."
    },
    {
      "title": "[Retail Investor Allocation - Net Offer Category]",
      "full_query": "[Retail Investor Allocation - Net Offer Category]\nOn page 3, it has been observed that Eco Fuel Systems (India) Limited has not disclosed the allocation in the net offer category for retail individual investors. This is a mandatory requirement under sub-regulation (1) of regulation 6 of the SEBI (ICDR) Regulations, 2018, which stipulates that the allocation in the net offer category shall be not less than thirty-five per cent. to retail individual investors. The DRHP currently provides figures of 21.60%, 15.08%, and 7.87% without clear context to their allocation to retail individual investors in the net offer category. Furthermore, there is an AMOUNT_CONFLICT on pages [3, 3] which needs to be resolved.\n\nRecommendation: Kindly provide the specific percentage or number of shares allocated to retail individual investors in the net offer category, ensuring it meets the minimum requirement of thirty-five per cent. Kindly also resolve the AMOUNT_CONFLICT on pages [3, 3].\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\nCRITICAL: Page 3",
      "page": "3",
      "severity": "Critical",
      "regulation": "SEBI (ICDR) Regulations, 2018",
      "status": "MISSING",
      "obligation": "In an issue made through the book building process under sub-regulation (1) of regulation 6, the allocation in the net offer category shall be not less than thirty five per cent. to retail individual investors."
    },
    {
      "title": "**Retail Investor Allocation Disclosure**",
      "full_query": "**Retail Investor Allocation Disclosure**\nOn page [3], it has been observed that Eco Fuel Systems (India) Limited has not disclosed the percentage allocation to retail individual investors in the net offer category for book-built issues. The DRHP mentions figures of 21.60%, 15.08%, and 7.87% in relation to other aspects of the offering, but the specific allocation to retail individual investors as per sub-regulation (2) of regulation 6 is missing. There is also an AMOUNT_CONFLICT on pages [3, 3] which needs to be addressed.\n\nRecommendation: Kindly disclose the percentage allocation to retail individual investors in the net offer category, ensuring it does not exceed ten per cent as stipulated by the regulations.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\n[Severity]: Page [3]",
      "page": "3",
      "severity": "Critical",
      "regulation": "SEBI (ICDR) Regulations, 2018",
      "status": "MISSING",
      "obligation": "In an issue made through the book building process under sub-regulation (2) of regulation 6, the allocation in the net offer category shall be not more than ten per cent. to retail individual investors."
    },
    {
      "title": "The issuer shall redeem the convertible debt instruments in terms of t",
      "full_query": "**Convertible Debt Instrument Redemption Terms**\n\nOn page [3], \"...CNG Vehicles Market India We are engaged in the business of distribution of LPG, CNG, and LNG conversion kits. The LPG (Liquefied Petroleum Gas), CNG (Compressed Natural Gas), and LNG (Liquefied Natural Gas) conversion kits providing the benefits in terms of cost, environmental impact, and vehicle performance. Our business is predominantly conducted on B2B and B2C in India. We derive our revenue from institutional customers and retail Customers . For the financial years 2025, 2024 and 2023, our ...\". It has been observed that Eco Fuel Systems (India) Limited has not disclosed the obligation to redeem the convertible debt instruments in terms of the letter of offer, nor has it provided confirmation of obtaining a credit rating from at least one credit rating agency for the convertible debt instruments. Additionally, there is an AMOUNT_CONFLICT on pages [3, 3] which requires clarification.\n\nRecommendation: Kindly provide the detailed terms for the redemption of convertible debt instruments as per the letter of offer, confirm the credit rating obtained for these instruments, and resolve the AMOUNT_CONFLICT on pages [3, 3].\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\n[Severity]: CRITICAL Page [3]",
      "page": "3",
      "severity": "Major",
      "regulation": "SEBI (ICDR) Regulations, 2018",
      "status": "MISSING",
      "obligation": "The issuer shall redeem the convertible debt instruments in terms of the letter of offer."
    },
    {
      "title": "in case of a fast track issue of convertible debt instruments, a due d",
      "full_query": "**Missing Debenture Trustee Due Diligence Certificate**\n\nOn page [3], it has been observed that Eco Fuel Systems (India) Limited has not disclosed the due diligence certificate from the debenture trustee as per Form B of Schedule V. This certificate is a mandatory requirement for fast-track issues of convertible debt instruments.\n\nRecommendation: Kindly submit the due diligence certificate from the debenture trustee as per Form B of Schedule V.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\n[Severity]: Page [3]",
      "page": "3",
      "severity": "Major",
      "regulation": "SEBI (ICDR) Regulations, 2018",
      "status": "MISSING",
      "obligation": "in case of a fast track issue of convertible debt instruments, a due diligence certificate from the debenture trustee as per Form B of Schedule V."
    },
    {
      "title": "[Locked-in Securities and Loan Financing Details]",
      "full_query": "[Locked-in Securities and Loan Financing Details]\nOn page [3], \"...CNG Vehicles Market India We are engaged in the business of distribution of LPG, CNG, and LNG conversion kits. The LPG (Liquefied Petroleum Gas), CNG (Compressed Natural Gas), and LNG (Liquefied Natural Gas) conversion kits providing the benefits in terms of cost, environmental impact, and vehicle performance. Our business is predominantly conducted on B2B and B2C in India. We derive our revenue from institutional customers and retail Customers . For the financial years 2025, 2024 and 2023, our ...\". It has been observed that Eco Fuel Systems (India) Limited has not disclosed information regarding locked-in securities as per regulation 16(a) or 16(b), details of loans granted to the issuer or its subsidiaries for financing objects of the issue, and confirmation if the pledge of specified securities is a term of loan sanction. Furthermore, there is an AMOUNT_CONFLICT on pages [3, 3] which requires clarification.\n\nRecommendation: Kindly provide comprehensive details pertaining to locked-in securities, loan financing for the objects of the issue, and the pledge of specified securities as a loan sanction term. Kindly also address and resolve the AMOUNT_CONFLICT on pages [3, 3].\n\nRegulation Ref: Regulation 4, 26\n\n[CRITICAL]: Page [3]",
      "page": "3",
      "severity": "Major",
      "regulation": "Regulation 4, 26",
      "status": "MISSING",
      "obligation": "If the specified securities are locked-in in terms of clause (a) of regulation 16, the loan has been granted to the issuer company or its subsidiary(ies) for the purpose of financing one or more of the objects of the issue and pledge of specified securities is one of the terms of sanction of the loan."
    },
    {
      "title": "**Disclosure of Rights Entitlement Process**",
      "full_query": "**Disclosure of Rights Entitlement Process**\nOn page [3], it has been observed that Eco Fuel Systems (India) Limited has not disclosed the process of credit of rights entitlements in the demat account and the process of renunciation thereof. This information is crucial for investors to understand the mechanics of participating in the rights issue.\n\nRecommendation: Kindly disclose the complete process of credit of rights entitlements in the demat account and the process of renunciation of rights entitlements.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\n[Severity]: Page [3]",
      "page": "3",
      "severity": "Major",
      "regulation": "SEBI (ICDR) Regulations, 2018",
      "status": "MISSING",
      "obligation": "In the letter of offer and the abridged letter of offer, the issuer shall disclose the process of credit of rights entitlements in the demat account and renunciation thereof."
    },
    {
      "title": "The monitoring agency shall submit its report to the issuer in the for",
      "full_query": "**Monitoring Agency Reporting Compliance**\n\nOn page [3], \"...el caters to retail customers through our network of dealers and retrofitment centres. Our operational model involves sourcing alternative fuel kits, empty cylinders and other automobile ancillaries directly from our suppliers. Once procured, these kits are distributed to our authorized dealers, who handle the installation of the kits for the retail customers. The dealers are equipped with the necessary technical knowledge and support provided by Eco fuel to ensure a seamless fitment and after s...\" it has been observed that Eco Fuel Systems (India) Limited has not disclosed the appointment of a monitoring agency, the details of the monitoring agency's report format as per Schedule XI, the quarterly reporting schedule, and the public dissemination process of monitoring agency reports. This is a mandatory disclosure requirement under the SEBI (ICDR) Regulations, 2018, for monitoring the utilization of issue proceeds.\n\nRecommendation: Kindly disclose the appointment of a monitoring agency, the format of its reports as per Schedule XI, the quarterly reporting schedule, and the public dissemination process.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\n[Critical]: Page [3]",
      "page": "3",
      "severity": "Major",
      "regulation": "SEBI (ICDR) Regulations, 2018",
      "status": "MISSING",
      "obligation": "The monitoring agency shall submit its report to the issuer in the format specified in Schedule XI on a quarterly basis, till hundred per cent. of the proceeds of the issue actually raised have been utilised."
    },
    {
      "title": "[Allocation to Non-Institutional Investors]",
      "full_query": "[Allocation to Non-Institutional Investors]\nOn page [3], it has been observed that Eco Fuel Systems (India) Limited has not disclosed the allocation percentage for non-institutional investors in the net offer category. This is a mandatory disclosure requirement as per SEBI (ICDR) Regulations, 2018, which stipulates that the allocation in the net offer category shall be not less than fifteen per cent. to non-institutional investors.\n\nRecommendation: Kindly provide the specific allocation percentage for non-institutional investors in the net offer category.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\n[Severity]: Page [3]",
      "page": "3",
      "severity": "Critical",
      "regulation": "SEBI (ICDR) Regulations, 2018",
      "status": "MISSING",
      "obligation": "In an issue made through the book building process under sub-regulation (1) of regulation 6, the allocation in the net offer category shall be not less than fifteen per cent. to non-institutional investors."
    },
    {
      "title": "**Lead Manager's Role in Ensuring Issuer Obligations**",
      "full_query": "**Lead Manager's Role in Ensuring Issuer Obligations**\nOn page 4, \"...es. Our operational model involves sourcing alternative fuel kits, empty cylinders and other automobile ancillaries directly from our suppliers. Once procured, these kits are distributed to our authorized dealers, who handle the installation of the kits for the retail customers. The dealers are equipped with the necessary technical knowledge and support provided by Eco fuel to ensure a seamless fitment and after sales & service process. We also provides end-to-end assistance, including product k...\". It has been observed that Eco Fuel Systems (India) Limited has not disclosed the specific obligations of the lead manager(s) in ensuring that the issuer, its promoters, directors, and selling shareholders fulfil their respective obligations as disclosed in the DRHP and as required by the Regulations.\n\nRecommendation: Kindly disclose the specific role and responsibilities of the lead manager(s) in monitoring and ensuring the fulfilment of all obligations by the issuer, its promoters, directors, and selling shareholders.\n\nRegulation Ref: Regulation 31, Schedule VIII\n\n[Severity]: Page 4\n\n**Note:** While the provided DRHP excerpt is limited, the query is structured to address the *missing* information regarding the lead manager's compliance role, as per the instructions. The figures (19.04%, 11.14%, 0.00%) and the AMOUNT_CONFLICT on pages [9, 9] are not directly relevant to the specific compliance obligation and missing detail requested for this query.",
      "page": "4",
      "severity": "Critical",
      "regulation": "Regulation 31, Schedule VIII",
      "status": "MISSING",
      "obligation": "The lead manager(s) shall call upon the issuer, its promoters and its directors to fulfil their obligations as disclosed by them in the draft letter of offer and letter of offer and as required in terms of these Regulations."
    },
    {
      "title": "**Employee Reservation Pricing**",
      "full_query": "**Employee Reservation Pricing**\nOn page [4], it has been observed that Eco Fuel Systems (India) Limited has not disclosed whether the issuer intends to offer specified securities to its employees, and if so, the pricing methodology relative to the floor price as per Part D of Schedule XIII of the SEBI (ICDR) Regulations, 2018. This is a mandatory disclosure requirement if the issuer opts for the alternate method of book building.\n\nRecommendation: Kindly disclose whether an employee reservation is being offered and, if so, provide details on the pricing mechanism, ensuring it is not lower than ten per cent. of the floor price.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\n[Severity]: Page [4]",
      "page": "4",
      "severity": "Critical",
      "regulation": "SEBI (ICDR) Regulations, 2018",
      "status": "MISSING",
      "obligation": "In case the issuer opts for the alternate method of book building in terms of Part D of Schedule XIII , the issuer may offer the specified securities to its employees at a price not lower than by more than ten per cent. of the floor price."
    },
    {
      "title": "it shall create a debenture redemption reserve in accordance with the ",
      "full_query": "**Debenture Redemption Reserve and Trustee Appointment**\n\nOn page [4], it has been observed that Eco Fuel Systems (India) Limited has not disclosed the creation of a debenture redemption reserve in accordance with the provisions of the Companies Act, 2013 and rules made thereunder. Furthermore, there is no disclosure regarding the appointment of at least one debenture trustee in accordance with the Companies Act, 2013 and SEBI (Debenture Trustees) Regulations, 1993.\n\nRecommendation: Kindly provide details on the creation of a debenture redemption reserve and confirm the appointment of at least one debenture trustee.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\n[Severity]: Page [4]",
      "page": "4",
      "severity": "Major",
      "regulation": "SEBI (ICDR) Regulations, 2018",
      "status": "MISSING",
      "obligation": "it shall create a debenture redemption reserve in accordance with the provisions of the Companies Act, 2013 and rules made thereunder;"
    },
    {
      "title": "[Due Diligence Certificate and Additional Confirmations]",
      "full_query": "[Due Diligence Certificate and Additional Confirmations]\nOn page 4, it has been observed that Eco Fuel Systems (India) Limited has not disclosed the due diligence certificate as per Form A of Schedule V, including additional confirmations as specified in Form E of Schedule V. This is a mandatory requirement for the lead manager(s) to submit along with the letter of offer.\n\nRecommendation: Kindly submit the due diligence certificate as per Form A of Schedule V, including additional confirmations as specified in Form E of Schedule V.\n\nRegulation Ref: Regulation 31, Schedule VIII\n\n[CRITICAL]: Page 4",
      "page": "4",
      "severity": "Critical",
      "regulation": "Regulation 31, Schedule VIII",
      "status": "MISSING",
      "obligation": "The lead manager(s) shall submit to the Board, the following documents along with the letter of offer: a due diligence certificate as per Form A of Schedule V including additional confirmations as specified in Form E of Schedule V."
    },
    {
      "title": "**Underwriting Details Not Disclosed**",
      "full_query": "**Underwriting Details Not Disclosed**\nOn page [4], it has been observed that Eco Fuel Systems (India) Limited has not disclosed details regarding the appointment of merchant bankers or stock brokers to act as underwriters for the initial public offer. This includes confirmation of an underwriting agreement and the number of specified securities to be subscribed by underwriters on account of rejection of applications.\n\nRecommendation: Kindly provide details regarding the appointment of underwriters, the underwriting agreement, and the number of securities to be subscribed by underwriters in case of rejection of applications.\n\nRegulation Ref: Regulation 31, Schedule VIII\n\n[Severity]: Page [4]",
      "page": "4",
      "severity": "Critical",
      "regulation": "Regulation 31, Schedule VIII",
      "status": "MISSING",
      "obligation": "If the issuer making an initial public offer, other than through the book building process, desires to have the issue underwritten, it shall appoint merchant bankers or stock brokers, registered with the Board, to act as underwriters."
    },
    {
      "title": "[Disclosure of Terms of Conversion or Exchange]",
      "full_query": "[Disclosure of Terms of Conversion or Exchange]\nOn page [6], it has been observed that Eco Fuel Systems (India) Limited has not disclosed the full terms of conversion or exchange.\n\nRecommendation: Kindly provide the complete terms of conversion or exchange for all relevant instruments.\n\nRegulation Ref: SEBI (ICDR) Regulations, 2018\n\n[Severity]: Page [6]",
      "page": "6",
      "severity": "Major",
      "regulation": "SEBI (ICDR) Regulations, 2018",
      "status": "MISSING",
      "obligation": "The draft letter of offer and letter of offer shall contain disclosures as specified in Part B or Part B -1 of Schedule VI, as applicable."
    }
  ],
  "chapters_checked": [
    "Chapter II"
  ],
  "adaptive_expansion": {
    "initial_batch": 30,
    "expanded_by": 30,
    "expansion_reason": "High missing rate: 90%",
    "total_checked": 60
  },
  "completed_at": "2025-12-31T12:31:38.019105",
  "processing_time_seconds": 194,
  "created_at": "2025-12-31T12:28:23.989532"
}